/* automatically generated by rust-bindgen 0.71.1 */

# [repr (C)] # [derive (Copy , Clone , Debug , Default , Eq , Hash , Ord , PartialEq , PartialOrd)] pub struct __BindgenBitfieldUnit < Storage > { storage : Storage , } impl < Storage > __BindgenBitfieldUnit < Storage > { # [inline] pub const fn new (storage : Storage) -> Self { Self { storage } } } impl < Storage > __BindgenBitfieldUnit < Storage > where Storage : AsRef < [u8] > + AsMut < [u8] >, { # [inline] fn extract_bit (byte : u8 , index : usize) -> bool { let bit_index = if cfg ! (target_endian = "big") { 7 - (index % 8) } else { index % 8 } ; let mask = 1 << bit_index ; byte & mask == mask } # [inline] pub fn get_bit (& self , index : usize) -> bool { debug_assert ! (index / 8 < self . storage . as_ref () . len ()) ; let byte_index = index / 8 ; let byte = self . storage . as_ref () [byte_index] ; Self :: extract_bit (byte , index) } # [inline] pub unsafe fn raw_get_bit (this : * const Self , index : usize) -> bool { debug_assert ! (index / 8 < core :: mem :: size_of ::< Storage > ()) ; let byte_index = index / 8 ; let byte = * (core :: ptr :: addr_of ! ((* this) . storage) as * const u8) . offset (byte_index as isize) ; Self :: extract_bit (byte , index) } # [inline] fn change_bit (byte : u8 , index : usize , val : bool) -> u8 { let bit_index = if cfg ! (target_endian = "big") { 7 - (index % 8) } else { index % 8 } ; let mask = 1 << bit_index ; if val { byte | mask } else { byte & ! mask } } # [inline] pub fn set_bit (& mut self , index : usize , val : bool) { debug_assert ! (index / 8 < self . storage . as_ref () . len ()) ; let byte_index = index / 8 ; let byte = & mut self . storage . as_mut () [byte_index] ; * byte = Self :: change_bit (* byte , index , val) ; } # [inline] pub unsafe fn raw_set_bit (this : * mut Self , index : usize , val : bool) { debug_assert ! (index / 8 < core :: mem :: size_of ::< Storage > ()) ; let byte_index = index / 8 ; let byte = (core :: ptr :: addr_of_mut ! ((* this) . storage) as * mut u8) . offset (byte_index as isize) ; * byte = Self :: change_bit (* byte , index , val) ; } # [inline] pub fn get (& self , bit_offset : usize , bit_width : u8) -> u64 { debug_assert ! (bit_width <= 64) ; debug_assert ! (bit_offset / 8 < self . storage . as_ref () . len ()) ; debug_assert ! ((bit_offset + (bit_width as usize)) / 8 <= self . storage . as_ref () . len ()) ; let mut val = 0 ; for i in 0 .. (bit_width as usize) { if self . get_bit (i + bit_offset) { let index = if cfg ! (target_endian = "big") { bit_width as usize - 1 - i } else { i } ; val |= 1 << index ; } } val } # [inline] pub unsafe fn raw_get (this : * const Self , bit_offset : usize , bit_width : u8 ,) -> u64 { debug_assert ! (bit_width <= 64) ; debug_assert ! (bit_offset / 8 < core :: mem :: size_of ::< Storage > ()) ; debug_assert ! ((bit_offset + (bit_width as usize)) / 8 <= core :: mem :: size_of ::< Storage > ()) ; let mut val = 0 ; for i in 0 .. (bit_width as usize) { if Self :: raw_get_bit (this , i + bit_offset) { let index = if cfg ! (target_endian = "big") { bit_width as usize - 1 - i } else { i } ; val |= 1 << index ; } } val } # [inline] pub fn set (& mut self , bit_offset : usize , bit_width : u8 , val : u64) { debug_assert ! (bit_width <= 64) ; debug_assert ! (bit_offset / 8 < self . storage . as_ref () . len ()) ; debug_assert ! ((bit_offset + (bit_width as usize)) / 8 <= self . storage . as_ref () . len ()) ; for i in 0 .. (bit_width as usize) { let mask = 1 << i ; let val_bit_is_set = val & mask == mask ; let index = if cfg ! (target_endian = "big") { bit_width as usize - 1 - i } else { i } ; self . set_bit (index + bit_offset , val_bit_is_set) ; } } # [inline] pub unsafe fn raw_set (this : * mut Self , bit_offset : usize , bit_width : u8 , val : u64 ,) { debug_assert ! (bit_width <= 64) ; debug_assert ! (bit_offset / 8 < core :: mem :: size_of ::< Storage > ()) ; debug_assert ! ((bit_offset + (bit_width as usize)) / 8 <= core :: mem :: size_of ::< Storage > ()) ; for i in 0 .. (bit_width as usize) { let mask = 1 << i ; let val_bit_is_set = val & mask == mask ; let index = if cfg ! (target_endian = "big") { bit_width as usize - 1 - i } else { i } ; Self :: raw_set_bit (this , index + bit_offset , val_bit_is_set) ; } } } # [repr (C)] # [derive (Default)] pub struct __IncompleteArrayField < T > (:: std :: marker :: PhantomData < T > , [T ; 0]) ; impl < T > __IncompleteArrayField < T > { # [inline] pub const fn new () -> Self { __IncompleteArrayField (:: std :: marker :: PhantomData , []) } # [inline] pub fn as_ptr (& self) -> * const T { self as * const _ as * const T } # [inline] pub fn as_mut_ptr (& mut self) -> * mut T { self as * mut _ as * mut T } # [inline] pub unsafe fn as_slice (& self , len : usize) -> & [T] { :: std :: slice :: from_raw_parts (self . as_ptr () , len) } # [inline] pub unsafe fn as_mut_slice (& mut self , len : usize) -> & mut [T] { :: std :: slice :: from_raw_parts_mut (self . as_mut_ptr () , len) } } impl < T > :: std :: fmt :: Debug for __IncompleteArrayField < T > { fn fmt (& self , fmt : & mut :: std :: fmt :: Formatter < '_ >) -> :: std :: fmt :: Result { fmt . write_str ("__IncompleteArrayField") } } pub const _SYS_IOCTL_H : u32 = 1 ; pub const _FEATURES_H : u32 = 1 ; pub const _DEFAULT_SOURCE : u32 = 1 ; pub const __USE_ISOC11 : u32 = 1 ; pub const __USE_ISOC99 : u32 = 1 ; pub const __USE_ISOC95 : u32 = 1 ; pub const __USE_POSIX_IMPLICITLY : u32 = 1 ; pub const _POSIX_SOURCE : u32 = 1 ; pub const _POSIX_C_SOURCE : u32 = 200809 ; pub const __USE_POSIX : u32 = 1 ; pub const __USE_POSIX2 : u32 = 1 ; pub const __USE_POSIX199309 : u32 = 1 ; pub const __USE_POSIX199506 : u32 = 1 ; pub const __USE_XOPEN2K : u32 = 1 ; pub const __USE_XOPEN2K8 : u32 = 1 ; pub const _ATFILE_SOURCE : u32 = 1 ; pub const __USE_MISC : u32 = 1 ; pub const __USE_ATFILE : u32 = 1 ; pub const __USE_FORTIFY_LEVEL : u32 = 0 ; pub const __GLIBC_USE_DEPRECATED_GETS : u32 = 0 ; pub const _STDC_PREDEF_H : u32 = 1 ; pub const __STDC_IEC_559__ : u32 = 1 ; pub const __STDC_IEC_559_COMPLEX__ : u32 = 1 ; pub const __STDC_ISO_10646__ : u32 = 201706 ; pub const __GNU_LIBRARY__ : u32 = 6 ; pub const __GLIBC__ : u32 = 2 ; pub const __GLIBC_MINOR__ : u32 = 28 ; pub const _SYS_CDEFS_H : u32 = 1 ; pub const __glibc_c99_flexarr_available : u32 = 1 ; pub const __WORDSIZE : u32 = 64 ; pub const __WORDSIZE_TIME64_COMPAT32 : u32 = 1 ; pub const __SYSCALL_WORDSIZE : u32 = 64 ; pub const __HAVE_GENERIC_SELECTION : u32 = 1 ; pub const _IOC_NRBITS : u32 = 8 ; pub const _IOC_TYPEBITS : u32 = 8 ; pub const _IOC_SIZEBITS : u32 = 14 ; pub const _IOC_DIRBITS : u32 = 2 ; pub const _IOC_NRMASK : u32 = 255 ; pub const _IOC_TYPEMASK : u32 = 255 ; pub const _IOC_SIZEMASK : u32 = 16383 ; pub const _IOC_DIRMASK : u32 = 3 ; pub const _IOC_NRSHIFT : u32 = 0 ; pub const _IOC_TYPESHIFT : u32 = 8 ; pub const _IOC_SIZESHIFT : u32 = 16 ; pub const _IOC_DIRSHIFT : u32 = 30 ; pub const _IOC_NONE : u32 = 0 ; pub const _IOC_WRITE : u32 = 1 ; pub const _IOC_READ : u32 = 2 ; pub const IOC_IN : u32 = 1073741824 ; pub const IOC_OUT : u32 = 2147483648 ; pub const IOC_INOUT : u32 = 3221225472 ; pub const IOCSIZE_MASK : u32 = 1073676288 ; pub const IOCSIZE_SHIFT : u32 = 16 ; pub const TCGETS : u32 = 21505 ; pub const TCSETS : u32 = 21506 ; pub const TCSETSW : u32 = 21507 ; pub const TCSETSF : u32 = 21508 ; pub const TCGETA : u32 = 21509 ; pub const TCSETA : u32 = 21510 ; pub const TCSETAW : u32 = 21511 ; pub const TCSETAF : u32 = 21512 ; pub const TCSBRK : u32 = 21513 ; pub const TCXONC : u32 = 21514 ; pub const TCFLSH : u32 = 21515 ; pub const TIOCEXCL : u32 = 21516 ; pub const TIOCNXCL : u32 = 21517 ; pub const TIOCSCTTY : u32 = 21518 ; pub const TIOCGPGRP : u32 = 21519 ; pub const TIOCSPGRP : u32 = 21520 ; pub const TIOCOUTQ : u32 = 21521 ; pub const TIOCSTI : u32 = 21522 ; pub const TIOCGWINSZ : u32 = 21523 ; pub const TIOCSWINSZ : u32 = 21524 ; pub const TIOCMGET : u32 = 21525 ; pub const TIOCMBIS : u32 = 21526 ; pub const TIOCMBIC : u32 = 21527 ; pub const TIOCMSET : u32 = 21528 ; pub const TIOCGSOFTCAR : u32 = 21529 ; pub const TIOCSSOFTCAR : u32 = 21530 ; pub const FIONREAD : u32 = 21531 ; pub const TIOCINQ : u32 = 21531 ; pub const TIOCLINUX : u32 = 21532 ; pub const TIOCCONS : u32 = 21533 ; pub const TIOCGSERIAL : u32 = 21534 ; pub const TIOCSSERIAL : u32 = 21535 ; pub const TIOCPKT : u32 = 21536 ; pub const FIONBIO : u32 = 21537 ; pub const TIOCNOTTY : u32 = 21538 ; pub const TIOCSETD : u32 = 21539 ; pub const TIOCGETD : u32 = 21540 ; pub const TCSBRKP : u32 = 21541 ; pub const TIOCSBRK : u32 = 21543 ; pub const TIOCCBRK : u32 = 21544 ; pub const TIOCGSID : u32 = 21545 ; pub const TIOCGRS485 : u32 = 21550 ; pub const TIOCSRS485 : u32 = 21551 ; pub const TCGETX : u32 = 21554 ; pub const TCSETX : u32 = 21555 ; pub const TCSETXF : u32 = 21556 ; pub const TCSETXW : u32 = 21557 ; pub const TIOCVHANGUP : u32 = 21559 ; pub const FIONCLEX : u32 = 21584 ; pub const FIOCLEX : u32 = 21585 ; pub const FIOASYNC : u32 = 21586 ; pub const TIOCSERCONFIG : u32 = 21587 ; pub const TIOCSERGWILD : u32 = 21588 ; pub const TIOCSERSWILD : u32 = 21589 ; pub const TIOCGLCKTRMIOS : u32 = 21590 ; pub const TIOCSLCKTRMIOS : u32 = 21591 ; pub const TIOCSERGSTRUCT : u32 = 21592 ; pub const TIOCSERGETLSR : u32 = 21593 ; pub const TIOCSERGETMULTI : u32 = 21594 ; pub const TIOCSERSETMULTI : u32 = 21595 ; pub const TIOCMIWAIT : u32 = 21596 ; pub const TIOCGICOUNT : u32 = 21597 ; pub const FIOQSIZE : u32 = 21600 ; pub const TIOCPKT_DATA : u32 = 0 ; pub const TIOCPKT_FLUSHREAD : u32 = 1 ; pub const TIOCPKT_FLUSHWRITE : u32 = 2 ; pub const TIOCPKT_STOP : u32 = 4 ; pub const TIOCPKT_START : u32 = 8 ; pub const TIOCPKT_NOSTOP : u32 = 16 ; pub const TIOCPKT_DOSTOP : u32 = 32 ; pub const TIOCPKT_IOCTL : u32 = 64 ; pub const TIOCSER_TEMT : u32 = 1 ; pub const SIOCADDRT : u32 = 35083 ; pub const SIOCDELRT : u32 = 35084 ; pub const SIOCRTMSG : u32 = 35085 ; pub const SIOCGIFNAME : u32 = 35088 ; pub const SIOCSIFLINK : u32 = 35089 ; pub const SIOCGIFCONF : u32 = 35090 ; pub const SIOCGIFFLAGS : u32 = 35091 ; pub const SIOCSIFFLAGS : u32 = 35092 ; pub const SIOCGIFADDR : u32 = 35093 ; pub const SIOCSIFADDR : u32 = 35094 ; pub const SIOCGIFDSTADDR : u32 = 35095 ; pub const SIOCSIFDSTADDR : u32 = 35096 ; pub const SIOCGIFBRDADDR : u32 = 35097 ; pub const SIOCSIFBRDADDR : u32 = 35098 ; pub const SIOCGIFNETMASK : u32 = 35099 ; pub const SIOCSIFNETMASK : u32 = 35100 ; pub const SIOCGIFMETRIC : u32 = 35101 ; pub const SIOCSIFMETRIC : u32 = 35102 ; pub const SIOCGIFMEM : u32 = 35103 ; pub const SIOCSIFMEM : u32 = 35104 ; pub const SIOCGIFMTU : u32 = 35105 ; pub const SIOCSIFMTU : u32 = 35106 ; pub const SIOCSIFNAME : u32 = 35107 ; pub const SIOCSIFHWADDR : u32 = 35108 ; pub const SIOCGIFENCAP : u32 = 35109 ; pub const SIOCSIFENCAP : u32 = 35110 ; pub const SIOCGIFHWADDR : u32 = 35111 ; pub const SIOCGIFSLAVE : u32 = 35113 ; pub const SIOCSIFSLAVE : u32 = 35120 ; pub const SIOCADDMULTI : u32 = 35121 ; pub const SIOCDELMULTI : u32 = 35122 ; pub const SIOCGIFINDEX : u32 = 35123 ; pub const SIOGIFINDEX : u32 = 35123 ; pub const SIOCSIFPFLAGS : u32 = 35124 ; pub const SIOCGIFPFLAGS : u32 = 35125 ; pub const SIOCDIFADDR : u32 = 35126 ; pub const SIOCSIFHWBROADCAST : u32 = 35127 ; pub const SIOCGIFCOUNT : u32 = 35128 ; pub const SIOCGIFBR : u32 = 35136 ; pub const SIOCSIFBR : u32 = 35137 ; pub const SIOCGIFTXQLEN : u32 = 35138 ; pub const SIOCSIFTXQLEN : u32 = 35139 ; pub const SIOCDARP : u32 = 35155 ; pub const SIOCGARP : u32 = 35156 ; pub const SIOCSARP : u32 = 35157 ; pub const SIOCDRARP : u32 = 35168 ; pub const SIOCGRARP : u32 = 35169 ; pub const SIOCSRARP : u32 = 35170 ; pub const SIOCGIFMAP : u32 = 35184 ; pub const SIOCSIFMAP : u32 = 35185 ; pub const SIOCADDDLCI : u32 = 35200 ; pub const SIOCDELDLCI : u32 = 35201 ; pub const SIOCDEVPRIVATE : u32 = 35312 ; pub const SIOCPROTOPRIVATE : u32 = 35296 ; pub const NCC : u32 = 8 ; pub const TIOCM_LE : u32 = 1 ; pub const TIOCM_DTR : u32 = 2 ; pub const TIOCM_RTS : u32 = 4 ; pub const TIOCM_ST : u32 = 8 ; pub const TIOCM_SR : u32 = 16 ; pub const TIOCM_CTS : u32 = 32 ; pub const TIOCM_CAR : u32 = 64 ; pub const TIOCM_RNG : u32 = 128 ; pub const TIOCM_DSR : u32 = 256 ; pub const TIOCM_CD : u32 = 64 ; pub const TIOCM_RI : u32 = 128 ; pub const N_TTY : u32 = 0 ; pub const N_SLIP : u32 = 1 ; pub const N_MOUSE : u32 = 2 ; pub const N_PPP : u32 = 3 ; pub const N_STRIP : u32 = 4 ; pub const N_AX25 : u32 = 5 ; pub const N_X25 : u32 = 6 ; pub const N_6PACK : u32 = 7 ; pub const N_MASC : u32 = 8 ; pub const N_R3964 : u32 = 9 ; pub const N_PROFIBUS_FDL : u32 = 10 ; pub const N_IRDA : u32 = 11 ; pub const N_SMSBLOCK : u32 = 12 ; pub const N_HDLC : u32 = 13 ; pub const N_SYNC_PPP : u32 = 14 ; pub const N_HCI : u32 = 15 ; pub const CEOL : u8 = 0u8 ; pub const CERASE : u32 = 127 ; pub const CSTATUS : u8 = 0u8 ; pub const CMIN : u32 = 1 ; pub const CQUIT : u32 = 28 ; pub const CTIME : u32 = 0 ; pub const CBRK : u8 = 0u8 ; pub const _UNISTD_H : u32 = 1 ; pub const _POSIX_VERSION : u32 = 200809 ; pub const __POSIX2_THIS_VERSION : u32 = 200809 ; pub const _POSIX2_VERSION : u32 = 200809 ; pub const _POSIX2_C_VERSION : u32 = 200809 ; pub const _POSIX2_C_BIND : u32 = 200809 ; pub const _POSIX2_C_DEV : u32 = 200809 ; pub const _POSIX2_SW_DEV : u32 = 200809 ; pub const _POSIX2_LOCALEDEF : u32 = 200809 ; pub const _XOPEN_VERSION : u32 = 700 ; pub const _XOPEN_XCU_VERSION : u32 = 4 ; pub const _XOPEN_XPG2 : u32 = 1 ; pub const _XOPEN_XPG3 : u32 = 1 ; pub const _XOPEN_XPG4 : u32 = 1 ; pub const _XOPEN_UNIX : u32 = 1 ; pub const _XOPEN_ENH_I18N : u32 = 1 ; pub const _XOPEN_LEGACY : u32 = 1 ; pub const _BITS_POSIX_OPT_H : u32 = 1 ; pub const _POSIX_JOB_CONTROL : u32 = 1 ; pub const _POSIX_SAVED_IDS : u32 = 1 ; pub const _POSIX_PRIORITY_SCHEDULING : u32 = 200809 ; pub const _POSIX_SYNCHRONIZED_IO : u32 = 200809 ; pub const _POSIX_FSYNC : u32 = 200809 ; pub const _POSIX_MAPPED_FILES : u32 = 200809 ; pub const _POSIX_MEMLOCK : u32 = 200809 ; pub const _POSIX_MEMLOCK_RANGE : u32 = 200809 ; pub const _POSIX_MEMORY_PROTECTION : u32 = 200809 ; pub const _POSIX_CHOWN_RESTRICTED : u32 = 0 ; pub const _POSIX_VDISABLE : u8 = 0u8 ; pub const _POSIX_NO_TRUNC : u32 = 1 ; pub const _XOPEN_REALTIME : u32 = 1 ; pub const _XOPEN_REALTIME_THREADS : u32 = 1 ; pub const _XOPEN_SHM : u32 = 1 ; pub const _POSIX_THREADS : u32 = 200809 ; pub const _POSIX_REENTRANT_FUNCTIONS : u32 = 1 ; pub const _POSIX_THREAD_SAFE_FUNCTIONS : u32 = 200809 ; pub const _POSIX_THREAD_PRIORITY_SCHEDULING : u32 = 200809 ; pub const _POSIX_THREAD_ATTR_STACKSIZE : u32 = 200809 ; pub const _POSIX_THREAD_ATTR_STACKADDR : u32 = 200809 ; pub const _POSIX_THREAD_PRIO_INHERIT : u32 = 200809 ; pub const _POSIX_THREAD_PRIO_PROTECT : u32 = 200809 ; pub const _POSIX_THREAD_ROBUST_PRIO_INHERIT : u32 = 200809 ; pub const _POSIX_THREAD_ROBUST_PRIO_PROTECT : i32 = - 1 ; pub const _POSIX_SEMAPHORES : u32 = 200809 ; pub const _POSIX_REALTIME_SIGNALS : u32 = 200809 ; pub const _POSIX_ASYNCHRONOUS_IO : u32 = 200809 ; pub const _POSIX_ASYNC_IO : u32 = 1 ; pub const _LFS_ASYNCHRONOUS_IO : u32 = 1 ; pub const _POSIX_PRIORITIZED_IO : u32 = 200809 ; pub const _LFS64_ASYNCHRONOUS_IO : u32 = 1 ; pub const _LFS_LARGEFILE : u32 = 1 ; pub const _LFS64_LARGEFILE : u32 = 1 ; pub const _LFS64_STDIO : u32 = 1 ; pub const _POSIX_SHARED_MEMORY_OBJECTS : u32 = 200809 ; pub const _POSIX_CPUTIME : u32 = 0 ; pub const _POSIX_THREAD_CPUTIME : u32 = 0 ; pub const _POSIX_REGEXP : u32 = 1 ; pub const _POSIX_READER_WRITER_LOCKS : u32 = 200809 ; pub const _POSIX_SHELL : u32 = 1 ; pub const _POSIX_TIMEOUTS : u32 = 200809 ; pub const _POSIX_SPIN_LOCKS : u32 = 200809 ; pub const _POSIX_SPAWN : u32 = 200809 ; pub const _POSIX_TIMERS : u32 = 200809 ; pub const _POSIX_BARRIERS : u32 = 200809 ; pub const _POSIX_MESSAGE_PASSING : u32 = 200809 ; pub const _POSIX_THREAD_PROCESS_SHARED : u32 = 200809 ; pub const _POSIX_MONOTONIC_CLOCK : u32 = 0 ; pub const _POSIX_CLOCK_SELECTION : u32 = 200809 ; pub const _POSIX_ADVISORY_INFO : u32 = 200809 ; pub const _POSIX_IPV6 : u32 = 200809 ; pub const _POSIX_RAW_SOCKETS : u32 = 200809 ; pub const _POSIX2_CHAR_TERM : u32 = 200809 ; pub const _POSIX_SPORADIC_SERVER : i32 = - 1 ; pub const _POSIX_THREAD_SPORADIC_SERVER : i32 = - 1 ; pub const _POSIX_TRACE : i32 = - 1 ; pub const _POSIX_TRACE_EVENT_FILTER : i32 = - 1 ; pub const _POSIX_TRACE_INHERIT : i32 = - 1 ; pub const _POSIX_TRACE_LOG : i32 = - 1 ; pub const _POSIX_TYPED_MEMORY_OBJECTS : i32 = - 1 ; pub const _XOPEN_STREAMS : i32 = - 1 ; pub const _POSIX_V7_LPBIG_OFFBIG : i32 = - 1 ; pub const _POSIX_V6_LPBIG_OFFBIG : i32 = - 1 ; pub const _XBS5_LPBIG_OFFBIG : i32 = - 1 ; pub const _POSIX_V7_LP64_OFF64 : u32 = 1 ; pub const _POSIX_V6_LP64_OFF64 : u32 = 1 ; pub const _XBS5_LP64_OFF64 : u32 = 1 ; pub const __ILP32_OFF32_CFLAGS : & [u8 ; 5] = b"-m32\0" ; pub const __ILP32_OFF32_LDFLAGS : & [u8 ; 5] = b"-m32\0" ; pub const __ILP32_OFFBIG_CFLAGS : & [u8 ; 48] = b"-m32 -D_LARGEFILE_SOURCE -D_FILE_OFFSET_BITS=64\0" ; pub const __ILP32_OFFBIG_LDFLAGS : & [u8 ; 5] = b"-m32\0" ; pub const __LP64_OFF64_CFLAGS : & [u8 ; 5] = b"-m64\0" ; pub const __LP64_OFF64_LDFLAGS : & [u8 ; 5] = b"-m64\0" ; pub const STDIN_FILENO : u32 = 0 ; pub const STDOUT_FILENO : u32 = 1 ; pub const STDERR_FILENO : u32 = 2 ; pub const _BITS_TYPES_H : u32 = 1 ; pub const _BITS_TYPESIZES_H : u32 = 1 ; pub const __OFF_T_MATCHES_OFF64_T : u32 = 1 ; pub const __INO_T_MATCHES_INO64_T : u32 = 1 ; pub const __RLIM_T_MATCHES_RLIM64_T : u32 = 1 ; pub const __FD_SETSIZE : u32 = 1024 ; pub const R_OK : u32 = 4 ; pub const W_OK : u32 = 2 ; pub const X_OK : u32 = 1 ; pub const F_OK : u32 = 0 ; pub const SEEK_SET : u32 = 0 ; pub const SEEK_CUR : u32 = 1 ; pub const SEEK_END : u32 = 2 ; pub const L_SET : u32 = 0 ; pub const L_INCR : u32 = 1 ; pub const L_XTND : u32 = 2 ; pub const _GETOPT_POSIX_H : u32 = 1 ; pub const _GETOPT_CORE_H : u32 = 1 ; pub const F_ULOCK : u32 = 0 ; pub const F_LOCK : u32 = 1 ; pub const F_TLOCK : u32 = 2 ; pub const F_TEST : u32 = 3 ; pub const __GLIBC_USE_LIB_EXT2 : u32 = 0 ; pub const __GLIBC_USE_IEC_60559_BFP_EXT : u32 = 0 ; pub const __GLIBC_USE_IEC_60559_FUNCS_EXT : u32 = 0 ; pub const __GLIBC_USE_IEC_60559_TYPES_EXT : u32 = 0 ; pub const _STDLIB_H : u32 = 1 ; pub const WNOHANG : u32 = 1 ; pub const WUNTRACED : u32 = 2 ; pub const WSTOPPED : u32 = 2 ; pub const WEXITED : u32 = 4 ; pub const WCONTINUED : u32 = 8 ; pub const WNOWAIT : u32 = 16777216 ; pub const __WNOTHREAD : u32 = 536870912 ; pub const __WALL : u32 = 1073741824 ; pub const __WCLONE : u32 = 2147483648 ; pub const __W_CONTINUED : u32 = 65535 ; pub const __WCOREFLAG : u32 = 128 ; pub const __HAVE_FLOAT128 : u32 = 0 ; pub const __HAVE_DISTINCT_FLOAT128 : u32 = 0 ; pub const __HAVE_FLOAT64X : u32 = 1 ; pub const __HAVE_FLOAT64X_LONG_DOUBLE : u32 = 1 ; pub const __HAVE_FLOAT16 : u32 = 0 ; pub const __HAVE_FLOAT32 : u32 = 1 ; pub const __HAVE_FLOAT64 : u32 = 1 ; pub const __HAVE_FLOAT32X : u32 = 1 ; pub const __HAVE_FLOAT128X : u32 = 0 ; pub const __HAVE_DISTINCT_FLOAT16 : u32 = 0 ; pub const __HAVE_DISTINCT_FLOAT32 : u32 = 0 ; pub const __HAVE_DISTINCT_FLOAT64 : u32 = 0 ; pub const __HAVE_DISTINCT_FLOAT32X : u32 = 0 ; pub const __HAVE_DISTINCT_FLOAT64X : u32 = 0 ; pub const __HAVE_DISTINCT_FLOAT128X : u32 = 0 ; pub const __HAVE_FLOATN_NOT_TYPEDEF : u32 = 0 ; pub const __ldiv_t_defined : u32 = 1 ; pub const __lldiv_t_defined : u32 = 1 ; pub const RAND_MAX : u32 = 2147483647 ; pub const EXIT_FAILURE : u32 = 1 ; pub const EXIT_SUCCESS : u32 = 0 ; pub const _SYS_TYPES_H : u32 = 1 ; pub const __clock_t_defined : u32 = 1 ; pub const __clockid_t_defined : u32 = 1 ; pub const __time_t_defined : u32 = 1 ; pub const __timer_t_defined : u32 = 1 ; pub const _BITS_STDINT_INTN_H : u32 = 1 ; pub const __BIT_TYPES_DEFINED__ : u32 = 1 ; pub const _ENDIAN_H : u32 = 1 ; pub const __LITTLE_ENDIAN : u32 = 1234 ; pub const __BIG_ENDIAN : u32 = 4321 ; pub const __PDP_ENDIAN : u32 = 3412 ; pub const __BYTE_ORDER : u32 = 1234 ; pub const __FLOAT_WORD_ORDER : u32 = 1234 ; pub const LITTLE_ENDIAN : u32 = 1234 ; pub const BIG_ENDIAN : u32 = 4321 ; pub const PDP_ENDIAN : u32 = 3412 ; pub const BYTE_ORDER : u32 = 1234 ; pub const _BITS_BYTESWAP_H : u32 = 1 ; pub const _BITS_UINTN_IDENTITY_H : u32 = 1 ; pub const _SYS_SELECT_H : u32 = 1 ; pub const __FD_ZERO_STOS : & [u8 ; 6] = b"stosq\0" ; pub const __sigset_t_defined : u32 = 1 ; pub const __timeval_defined : u32 = 1 ; pub const _STRUCT_TIMESPEC : u32 = 1 ; pub const FD_SETSIZE : u32 = 1024 ; pub const _BITS_PTHREADTYPES_COMMON_H : u32 = 1 ; pub const _THREAD_SHARED_TYPES_H : u32 = 1 ; pub const _BITS_PTHREADTYPES_ARCH_H : u32 = 1 ; pub const __SIZEOF_PTHREAD_MUTEX_T : u32 = 40 ; pub const __SIZEOF_PTHREAD_ATTR_T : u32 = 56 ; pub const __SIZEOF_PTHREAD_RWLOCK_T : u32 = 56 ; pub const __SIZEOF_PTHREAD_BARRIER_T : u32 = 32 ; pub const __SIZEOF_PTHREAD_MUTEXATTR_T : u32 = 4 ; pub const __SIZEOF_PTHREAD_COND_T : u32 = 48 ; pub const __SIZEOF_PTHREAD_CONDATTR_T : u32 = 4 ; pub const __SIZEOF_PTHREAD_RWLOCKATTR_T : u32 = 8 ; pub const __SIZEOF_PTHREAD_BARRIERATTR_T : u32 = 4 ; pub const __PTHREAD_MUTEX_LOCK_ELISION : u32 = 1 ; pub const __PTHREAD_MUTEX_NUSERS_AFTER_KIND : u32 = 0 ; pub const __PTHREAD_MUTEX_USE_UNION : u32 = 0 ; pub const __PTHREAD_RWLOCK_INT_FLAGS_SHARED : u32 = 1 ; pub const __PTHREAD_MUTEX_HAVE_PREV : u32 = 1 ; pub const __have_pthread_attr_t : u32 = 1 ; pub const _ALLOCA_H : u32 = 1 ; pub const _STRING_H : u32 = 1 ; pub const _BITS_TYPES_LOCALE_T_H : u32 = 1 ; pub const _BITS_TYPES___LOCALE_T_H : u32 = 1 ; pub const _STRINGS_H : u32 = 1 ; pub const _MATH_H : u32 = 1 ; pub const _BITS_LIBM_SIMD_DECL_STUBS_H : u32 = 1 ; pub const __FP_LOGB0_IS_MIN : u32 = 1 ; pub const __FP_LOGBNAN_IS_MIN : u32 = 1 ; pub const __MATH_DECLARING_DOUBLE : u32 = 1 ; pub const __MATH_DECLARING_FLOATN : u32 = 0 ; pub const __MATH_DECLARE_LDOUBLE : u32 = 1 ; pub const MATH_ERRNO : u32 = 1 ; pub const MATH_ERREXCEPT : u32 = 2 ; pub const math_errhandling : u32 = 3 ; pub const M_E : f64 = 2.718281828459045 ; pub const M_LOG2E : f64 = 1.4426950408889634 ; pub const M_LOG10E : f64 = 0.4342944819032518 ; pub const M_LN2 : f64 = 0.6931471805599453 ; pub const M_LN10 : f64 = 2.302585092994046 ; pub const M_PI : f64 = 3.141592653589793 ; pub const M_PI_2 : f64 = 1.5707963267948966 ; pub const M_PI_4 : f64 = 0.7853981633974483 ; pub const M_1_PI : f64 = 0.3183098861837907 ; pub const M_2_PI : f64 = 0.6366197723675814 ; pub const M_2_SQRTPI : f64 = 1.1283791670955126 ; pub const M_SQRT2 : f64 = 1.4142135623730951 ; pub const M_SQRT1_2 : f64 = 0.7071067811865476 ; pub const _STDINT_H : u32 = 1 ; pub const _BITS_WCHAR_H : u32 = 1 ; pub const _BITS_STDINT_UINTN_H : u32 = 1 ; pub const INT8_MIN : i32 = - 128 ; pub const INT16_MIN : i32 = - 32768 ; pub const INT32_MIN : i32 = - 2147483648 ; pub const INT8_MAX : u32 = 127 ; pub const INT16_MAX : u32 = 32767 ; pub const INT32_MAX : u32 = 2147483647 ; pub const UINT8_MAX : u32 = 255 ; pub const UINT16_MAX : u32 = 65535 ; pub const UINT32_MAX : u32 = 4294967295 ; pub const INT_LEAST8_MIN : i32 = - 128 ; pub const INT_LEAST16_MIN : i32 = - 32768 ; pub const INT_LEAST32_MIN : i32 = - 2147483648 ; pub const INT_LEAST8_MAX : u32 = 127 ; pub const INT_LEAST16_MAX : u32 = 32767 ; pub const INT_LEAST32_MAX : u32 = 2147483647 ; pub const UINT_LEAST8_MAX : u32 = 255 ; pub const UINT_LEAST16_MAX : u32 = 65535 ; pub const UINT_LEAST32_MAX : u32 = 4294967295 ; pub const INT_FAST8_MIN : i32 = - 128 ; pub const INT_FAST16_MIN : i64 = - 9223372036854775808 ; pub const INT_FAST32_MIN : i64 = - 9223372036854775808 ; pub const INT_FAST8_MAX : u32 = 127 ; pub const INT_FAST16_MAX : u64 = 9223372036854775807 ; pub const INT_FAST32_MAX : u64 = 9223372036854775807 ; pub const UINT_FAST8_MAX : u32 = 255 ; pub const UINT_FAST16_MAX : i32 = - 1 ; pub const UINT_FAST32_MAX : i32 = - 1 ; pub const INTPTR_MIN : i64 = - 9223372036854775808 ; pub const INTPTR_MAX : u64 = 9223372036854775807 ; pub const UINTPTR_MAX : i32 = - 1 ; pub const PTRDIFF_MIN : i64 = - 9223372036854775808 ; pub const PTRDIFF_MAX : u64 = 9223372036854775807 ; pub const SIG_ATOMIC_MIN : i32 = - 2147483648 ; pub const SIG_ATOMIC_MAX : u32 = 2147483647 ; pub const SIZE_MAX : i32 = - 1 ; pub const WINT_MIN : u32 = 0 ; pub const WINT_MAX : u32 = 4294967295 ; pub const __BITS_PER_LONG : u32 = 64 ; pub const NSEC_PER_SEC : u32 = 1000000000 ; pub const SCOUTFS_IOCTL_MAGIC : u32 = 232 ; pub const SCOUTFS_IOC_DWO_READ : u32 = 1 ; pub const SCOUTFS_IOC_DWO_WRITE : u32 = 2 ; pub const SCOUTFS_IOC_DWO_CHANGE_SIZE : u32 = 4 ; pub const SCOUTFS_IOC_SETATTR_MORE_OFFLINE : u32 = 1 ; pub const SCOUTFS_SEARCH_XATTRS_OFLAG_END : u32 = 1 ; pub const SCOUTFS_IOC_MB_STAGE : u32 = 1 ; pub const SCOUTFS_IOCTL_XATTR_TOTAL_NAME_NR : u32 = 3 ; pub const SCOUTFS_IOCTL_DIRENT_FLAG_LAST : u32 = 1 ; pub const SCOUTFS_IOC_IAX_F_SIZE_OFFLINE : u32 = 1 ; pub const SCOUTFS_IOC_IAX_B_RETENTION : u32 = 1 ; pub const SCOUTFS_IOC_IAX_META_SEQ : u32 = 1 ; pub const SCOUTFS_IOC_IAX_DATA_SEQ : u32 = 2 ; pub const SCOUTFS_IOC_IAX_DATA_VERSION : u32 = 4 ; pub const SCOUTFS_IOC_IAX_ONLINE_BLOCKS : u32 = 8 ; pub const SCOUTFS_IOC_IAX_OFFLINE_BLOCKS : u32 = 16 ; pub const SCOUTFS_IOC_IAX_CTIME : u32 = 32 ; pub const SCOUTFS_IOC_IAX_CRTIME : u32 = 64 ; pub const SCOUTFS_IOC_IAX_SIZE : u32 = 128 ; pub const SCOUTFS_IOC_IAX_RETENTION : u32 = 256 ; pub const SCOUTFS_IOC_IAX_PROJECT_ID : u32 = 512 ; pub const SCOUTFS_IOC_IAX__BITS : u32 = 256 ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct winsize { pub ws_row : :: std :: os :: raw :: c_ushort , pub ws_col : :: std :: os :: raw :: c_ushort , pub ws_xpixel : :: std :: os :: raw :: c_ushort , pub ws_ypixel : :: std :: os :: raw :: c_ushort , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of winsize"] [:: std :: mem :: size_of :: < winsize > () - 8usize] ; ["Alignment of winsize"] [:: std :: mem :: align_of :: < winsize > () - 2usize] ; ["Offset of field: winsize::ws_row"] [:: std :: mem :: offset_of ! (winsize , ws_row) - 0usize] ; ["Offset of field: winsize::ws_col"] [:: std :: mem :: offset_of ! (winsize , ws_col) - 2usize] ; ["Offset of field: winsize::ws_xpixel"] [:: std :: mem :: offset_of ! (winsize , ws_xpixel) - 4usize] ; ["Offset of field: winsize::ws_ypixel"] [:: std :: mem :: offset_of ! (winsize , ws_ypixel) - 6usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct termio { pub c_iflag : :: std :: os :: raw :: c_ushort , pub c_oflag : :: std :: os :: raw :: c_ushort , pub c_cflag : :: std :: os :: raw :: c_ushort , pub c_lflag : :: std :: os :: raw :: c_ushort , pub c_line : :: std :: os :: raw :: c_uchar , pub c_cc : [:: std :: os :: raw :: c_uchar ; 8usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of termio"] [:: std :: mem :: size_of :: < termio > () - 18usize] ; ["Alignment of termio"] [:: std :: mem :: align_of :: < termio > () - 2usize] ; ["Offset of field: termio::c_iflag"] [:: std :: mem :: offset_of ! (termio , c_iflag) - 0usize] ; ["Offset of field: termio::c_oflag"] [:: std :: mem :: offset_of ! (termio , c_oflag) - 2usize] ; ["Offset of field: termio::c_cflag"] [:: std :: mem :: offset_of ! (termio , c_cflag) - 4usize] ; ["Offset of field: termio::c_lflag"] [:: std :: mem :: offset_of ! (termio , c_lflag) - 6usize] ; ["Offset of field: termio::c_line"] [:: std :: mem :: offset_of ! (termio , c_line) - 8usize] ; ["Offset of field: termio::c_cc"] [:: std :: mem :: offset_of ! (termio , c_cc) - 9usize] ; } ; unsafe extern "C" { pub fn ioctl (__fd : :: std :: os :: raw :: c_int , __request : :: std :: os :: raw :: c_ulong , ...) -> :: std :: os :: raw :: c_int ; } pub type __u_char = :: std :: os :: raw :: c_uchar ; pub type __u_short = :: std :: os :: raw :: c_ushort ; pub type __u_int = :: std :: os :: raw :: c_uint ; pub type __u_long = :: std :: os :: raw :: c_ulong ; pub type __int8_t = :: std :: os :: raw :: c_schar ; pub type __uint8_t = :: std :: os :: raw :: c_uchar ; pub type __int16_t = :: std :: os :: raw :: c_short ; pub type __uint16_t = :: std :: os :: raw :: c_ushort ; pub type __int32_t = :: std :: os :: raw :: c_int ; pub type __uint32_t = :: std :: os :: raw :: c_uint ; pub type __int64_t = :: std :: os :: raw :: c_long ; pub type __uint64_t = :: std :: os :: raw :: c_ulong ; pub type __int_least8_t = __int8_t ; pub type __uint_least8_t = __uint8_t ; pub type __int_least16_t = __int16_t ; pub type __uint_least16_t = __uint16_t ; pub type __int_least32_t = __int32_t ; pub type __uint_least32_t = __uint32_t ; pub type __int_least64_t = __int64_t ; pub type __uint_least64_t = __uint64_t ; pub type __quad_t = :: std :: os :: raw :: c_long ; pub type __u_quad_t = :: std :: os :: raw :: c_ulong ; pub type __intmax_t = :: std :: os :: raw :: c_long ; pub type __uintmax_t = :: std :: os :: raw :: c_ulong ; pub type __dev_t = :: std :: os :: raw :: c_ulong ; pub type __uid_t = :: std :: os :: raw :: c_uint ; pub type __gid_t = :: std :: os :: raw :: c_uint ; pub type __ino_t = :: std :: os :: raw :: c_ulong ; pub type __ino64_t = :: std :: os :: raw :: c_ulong ; pub type __mode_t = :: std :: os :: raw :: c_uint ; pub type __nlink_t = :: std :: os :: raw :: c_ulong ; pub type __off_t = :: std :: os :: raw :: c_long ; pub type __off64_t = :: std :: os :: raw :: c_long ; pub type __pid_t = :: std :: os :: raw :: c_int ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __fsid_t { pub __val : [:: std :: os :: raw :: c_int ; 2usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __fsid_t"] [:: std :: mem :: size_of :: < __fsid_t > () - 8usize] ; ["Alignment of __fsid_t"] [:: std :: mem :: align_of :: < __fsid_t > () - 4usize] ; ["Offset of field: __fsid_t::__val"] [:: std :: mem :: offset_of ! (__fsid_t , __val) - 0usize] ; } ; pub type __clock_t = :: std :: os :: raw :: c_long ; pub type __rlim_t = :: std :: os :: raw :: c_ulong ; pub type __rlim64_t = :: std :: os :: raw :: c_ulong ; pub type __id_t = :: std :: os :: raw :: c_uint ; pub type __time_t = :: std :: os :: raw :: c_long ; pub type __useconds_t = :: std :: os :: raw :: c_uint ; pub type __suseconds_t = :: std :: os :: raw :: c_long ; pub type __daddr_t = :: std :: os :: raw :: c_int ; pub type __key_t = :: std :: os :: raw :: c_int ; pub type __clockid_t = :: std :: os :: raw :: c_int ; pub type __timer_t = * mut :: std :: os :: raw :: c_void ; pub type __blksize_t = :: std :: os :: raw :: c_long ; pub type __blkcnt_t = :: std :: os :: raw :: c_long ; pub type __blkcnt64_t = :: std :: os :: raw :: c_long ; pub type __fsblkcnt_t = :: std :: os :: raw :: c_ulong ; pub type __fsblkcnt64_t = :: std :: os :: raw :: c_ulong ; pub type __fsfilcnt_t = :: std :: os :: raw :: c_ulong ; pub type __fsfilcnt64_t = :: std :: os :: raw :: c_ulong ; pub type __fsword_t = :: std :: os :: raw :: c_long ; pub type __ssize_t = :: std :: os :: raw :: c_long ; pub type __syscall_slong_t = :: std :: os :: raw :: c_long ; pub type __syscall_ulong_t = :: std :: os :: raw :: c_ulong ; pub type __loff_t = __off64_t ; pub type __caddr_t = * mut :: std :: os :: raw :: c_char ; pub type __intptr_t = :: std :: os :: raw :: c_long ; pub type __socklen_t = :: std :: os :: raw :: c_uint ; pub type __sig_atomic_t = :: std :: os :: raw :: c_int ; pub type gid_t = __gid_t ; pub type uid_t = __uid_t ; pub type off_t = __off_t ; pub type useconds_t = __useconds_t ; pub type pid_t = __pid_t ; pub type socklen_t = __socklen_t ; unsafe extern "C" { pub fn access (__name : * const :: std :: os :: raw :: c_char , __type : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn faccessat (__fd : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __type : :: std :: os :: raw :: c_int , __flag : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn lseek (__fd : :: std :: os :: raw :: c_int , __offset : __off_t , __whence : :: std :: os :: raw :: c_int) -> __off_t ; } unsafe extern "C" { pub fn close (__fd : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn read (__fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_void , __nbytes : usize) -> isize ; } unsafe extern "C" { pub fn write (__fd : :: std :: os :: raw :: c_int , __buf : * const :: std :: os :: raw :: c_void , __n : usize) -> isize ; } unsafe extern "C" { pub fn pread (__fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_void , __nbytes : usize , __offset : __off_t) -> isize ; } unsafe extern "C" { pub fn pwrite (__fd : :: std :: os :: raw :: c_int , __buf : * const :: std :: os :: raw :: c_void , __n : usize , __offset : __off_t) -> isize ; } unsafe extern "C" { pub fn pipe (__pipedes : * mut :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn alarm (__seconds : :: std :: os :: raw :: c_uint) -> :: std :: os :: raw :: c_uint ; } unsafe extern "C" { pub fn sleep (__seconds : :: std :: os :: raw :: c_uint) -> :: std :: os :: raw :: c_uint ; } unsafe extern "C" { pub fn ualarm (__value : __useconds_t , __interval : __useconds_t) -> __useconds_t ; } unsafe extern "C" { pub fn usleep (__useconds : __useconds_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn pause () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn chown (__file : * const :: std :: os :: raw :: c_char , __owner : __uid_t , __group : __gid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn fchown (__fd : :: std :: os :: raw :: c_int , __owner : __uid_t , __group : __gid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn lchown (__file : * const :: std :: os :: raw :: c_char , __owner : __uid_t , __group : __gid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn fchownat (__fd : :: std :: os :: raw :: c_int , __file : * const :: std :: os :: raw :: c_char , __owner : __uid_t , __group : __gid_t , __flag : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn chdir (__path : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn fchdir (__fd : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getcwd (__buf : * mut :: std :: os :: raw :: c_char , __size : usize) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn getwd (__buf : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn dup (__fd : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn dup2 (__fd : :: std :: os :: raw :: c_int , __fd2 : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub static mut __environ : * mut * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn execve (__path : * const :: std :: os :: raw :: c_char , __argv : * const * mut :: std :: os :: raw :: c_char , __envp : * const * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn fexecve (__fd : :: std :: os :: raw :: c_int , __argv : * const * mut :: std :: os :: raw :: c_char , __envp : * const * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn execv (__path : * const :: std :: os :: raw :: c_char , __argv : * const * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn execle (__path : * const :: std :: os :: raw :: c_char , __arg : * const :: std :: os :: raw :: c_char , ...) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn execl (__path : * const :: std :: os :: raw :: c_char , __arg : * const :: std :: os :: raw :: c_char , ...) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn execvp (__file : * const :: std :: os :: raw :: c_char , __argv : * const * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn execlp (__file : * const :: std :: os :: raw :: c_char , __arg : * const :: std :: os :: raw :: c_char , ...) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn nice (__inc : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn _exit (__status : :: std :: os :: raw :: c_int) -> ! ; } pub const _PC_LINK_MAX : _bindgen_ty_1 = 0 ; pub const _PC_MAX_CANON : _bindgen_ty_1 = 1 ; pub const _PC_MAX_INPUT : _bindgen_ty_1 = 2 ; pub const _PC_NAME_MAX : _bindgen_ty_1 = 3 ; pub const _PC_PATH_MAX : _bindgen_ty_1 = 4 ; pub const _PC_PIPE_BUF : _bindgen_ty_1 = 5 ; pub const _PC_CHOWN_RESTRICTED : _bindgen_ty_1 = 6 ; pub const _PC_NO_TRUNC : _bindgen_ty_1 = 7 ; pub const _PC_VDISABLE : _bindgen_ty_1 = 8 ; pub const _PC_SYNC_IO : _bindgen_ty_1 = 9 ; pub const _PC_ASYNC_IO : _bindgen_ty_1 = 10 ; pub const _PC_PRIO_IO : _bindgen_ty_1 = 11 ; pub const _PC_SOCK_MAXBUF : _bindgen_ty_1 = 12 ; pub const _PC_FILESIZEBITS : _bindgen_ty_1 = 13 ; pub const _PC_REC_INCR_XFER_SIZE : _bindgen_ty_1 = 14 ; pub const _PC_REC_MAX_XFER_SIZE : _bindgen_ty_1 = 15 ; pub const _PC_REC_MIN_XFER_SIZE : _bindgen_ty_1 = 16 ; pub const _PC_REC_XFER_ALIGN : _bindgen_ty_1 = 17 ; pub const _PC_ALLOC_SIZE_MIN : _bindgen_ty_1 = 18 ; pub const _PC_SYMLINK_MAX : _bindgen_ty_1 = 19 ; pub const _PC_2_SYMLINKS : _bindgen_ty_1 = 20 ; pub type _bindgen_ty_1 = :: std :: os :: raw :: c_uint ; pub const _SC_ARG_MAX : _bindgen_ty_2 = 0 ; pub const _SC_CHILD_MAX : _bindgen_ty_2 = 1 ; pub const _SC_CLK_TCK : _bindgen_ty_2 = 2 ; pub const _SC_NGROUPS_MAX : _bindgen_ty_2 = 3 ; pub const _SC_OPEN_MAX : _bindgen_ty_2 = 4 ; pub const _SC_STREAM_MAX : _bindgen_ty_2 = 5 ; pub const _SC_TZNAME_MAX : _bindgen_ty_2 = 6 ; pub const _SC_JOB_CONTROL : _bindgen_ty_2 = 7 ; pub const _SC_SAVED_IDS : _bindgen_ty_2 = 8 ; pub const _SC_REALTIME_SIGNALS : _bindgen_ty_2 = 9 ; pub const _SC_PRIORITY_SCHEDULING : _bindgen_ty_2 = 10 ; pub const _SC_TIMERS : _bindgen_ty_2 = 11 ; pub const _SC_ASYNCHRONOUS_IO : _bindgen_ty_2 = 12 ; pub const _SC_PRIORITIZED_IO : _bindgen_ty_2 = 13 ; pub const _SC_SYNCHRONIZED_IO : _bindgen_ty_2 = 14 ; pub const _SC_FSYNC : _bindgen_ty_2 = 15 ; pub const _SC_MAPPED_FILES : _bindgen_ty_2 = 16 ; pub const _SC_MEMLOCK : _bindgen_ty_2 = 17 ; pub const _SC_MEMLOCK_RANGE : _bindgen_ty_2 = 18 ; pub const _SC_MEMORY_PROTECTION : _bindgen_ty_2 = 19 ; pub const _SC_MESSAGE_PASSING : _bindgen_ty_2 = 20 ; pub const _SC_SEMAPHORES : _bindgen_ty_2 = 21 ; pub const _SC_SHARED_MEMORY_OBJECTS : _bindgen_ty_2 = 22 ; pub const _SC_AIO_LISTIO_MAX : _bindgen_ty_2 = 23 ; pub const _SC_AIO_MAX : _bindgen_ty_2 = 24 ; pub const _SC_AIO_PRIO_DELTA_MAX : _bindgen_ty_2 = 25 ; pub const _SC_DELAYTIMER_MAX : _bindgen_ty_2 = 26 ; pub const _SC_MQ_OPEN_MAX : _bindgen_ty_2 = 27 ; pub const _SC_MQ_PRIO_MAX : _bindgen_ty_2 = 28 ; pub const _SC_VERSION : _bindgen_ty_2 = 29 ; pub const _SC_PAGESIZE : _bindgen_ty_2 = 30 ; pub const _SC_RTSIG_MAX : _bindgen_ty_2 = 31 ; pub const _SC_SEM_NSEMS_MAX : _bindgen_ty_2 = 32 ; pub const _SC_SEM_VALUE_MAX : _bindgen_ty_2 = 33 ; pub const _SC_SIGQUEUE_MAX : _bindgen_ty_2 = 34 ; pub const _SC_TIMER_MAX : _bindgen_ty_2 = 35 ; pub const _SC_BC_BASE_MAX : _bindgen_ty_2 = 36 ; pub const _SC_BC_DIM_MAX : _bindgen_ty_2 = 37 ; pub const _SC_BC_SCALE_MAX : _bindgen_ty_2 = 38 ; pub const _SC_BC_STRING_MAX : _bindgen_ty_2 = 39 ; pub const _SC_COLL_WEIGHTS_MAX : _bindgen_ty_2 = 40 ; pub const _SC_EQUIV_CLASS_MAX : _bindgen_ty_2 = 41 ; pub const _SC_EXPR_NEST_MAX : _bindgen_ty_2 = 42 ; pub const _SC_LINE_MAX : _bindgen_ty_2 = 43 ; pub const _SC_RE_DUP_MAX : _bindgen_ty_2 = 44 ; pub const _SC_CHARCLASS_NAME_MAX : _bindgen_ty_2 = 45 ; pub const _SC_2_VERSION : _bindgen_ty_2 = 46 ; pub const _SC_2_C_BIND : _bindgen_ty_2 = 47 ; pub const _SC_2_C_DEV : _bindgen_ty_2 = 48 ; pub const _SC_2_FORT_DEV : _bindgen_ty_2 = 49 ; pub const _SC_2_FORT_RUN : _bindgen_ty_2 = 50 ; pub const _SC_2_SW_DEV : _bindgen_ty_2 = 51 ; pub const _SC_2_LOCALEDEF : _bindgen_ty_2 = 52 ; pub const _SC_PII : _bindgen_ty_2 = 53 ; pub const _SC_PII_XTI : _bindgen_ty_2 = 54 ; pub const _SC_PII_SOCKET : _bindgen_ty_2 = 55 ; pub const _SC_PII_INTERNET : _bindgen_ty_2 = 56 ; pub const _SC_PII_OSI : _bindgen_ty_2 = 57 ; pub const _SC_POLL : _bindgen_ty_2 = 58 ; pub const _SC_SELECT : _bindgen_ty_2 = 59 ; pub const _SC_UIO_MAXIOV : _bindgen_ty_2 = 60 ; pub const _SC_IOV_MAX : _bindgen_ty_2 = 60 ; pub const _SC_PII_INTERNET_STREAM : _bindgen_ty_2 = 61 ; pub const _SC_PII_INTERNET_DGRAM : _bindgen_ty_2 = 62 ; pub const _SC_PII_OSI_COTS : _bindgen_ty_2 = 63 ; pub const _SC_PII_OSI_CLTS : _bindgen_ty_2 = 64 ; pub const _SC_PII_OSI_M : _bindgen_ty_2 = 65 ; pub const _SC_T_IOV_MAX : _bindgen_ty_2 = 66 ; pub const _SC_THREADS : _bindgen_ty_2 = 67 ; pub const _SC_THREAD_SAFE_FUNCTIONS : _bindgen_ty_2 = 68 ; pub const _SC_GETGR_R_SIZE_MAX : _bindgen_ty_2 = 69 ; pub const _SC_GETPW_R_SIZE_MAX : _bindgen_ty_2 = 70 ; pub const _SC_LOGIN_NAME_MAX : _bindgen_ty_2 = 71 ; pub const _SC_TTY_NAME_MAX : _bindgen_ty_2 = 72 ; pub const _SC_THREAD_DESTRUCTOR_ITERATIONS : _bindgen_ty_2 = 73 ; pub const _SC_THREAD_KEYS_MAX : _bindgen_ty_2 = 74 ; pub const _SC_THREAD_STACK_MIN : _bindgen_ty_2 = 75 ; pub const _SC_THREAD_THREADS_MAX : _bindgen_ty_2 = 76 ; pub const _SC_THREAD_ATTR_STACKADDR : _bindgen_ty_2 = 77 ; pub const _SC_THREAD_ATTR_STACKSIZE : _bindgen_ty_2 = 78 ; pub const _SC_THREAD_PRIORITY_SCHEDULING : _bindgen_ty_2 = 79 ; pub const _SC_THREAD_PRIO_INHERIT : _bindgen_ty_2 = 80 ; pub const _SC_THREAD_PRIO_PROTECT : _bindgen_ty_2 = 81 ; pub const _SC_THREAD_PROCESS_SHARED : _bindgen_ty_2 = 82 ; pub const _SC_NPROCESSORS_CONF : _bindgen_ty_2 = 83 ; pub const _SC_NPROCESSORS_ONLN : _bindgen_ty_2 = 84 ; pub const _SC_PHYS_PAGES : _bindgen_ty_2 = 85 ; pub const _SC_AVPHYS_PAGES : _bindgen_ty_2 = 86 ; pub const _SC_ATEXIT_MAX : _bindgen_ty_2 = 87 ; pub const _SC_PASS_MAX : _bindgen_ty_2 = 88 ; pub const _SC_XOPEN_VERSION : _bindgen_ty_2 = 89 ; pub const _SC_XOPEN_XCU_VERSION : _bindgen_ty_2 = 90 ; pub const _SC_XOPEN_UNIX : _bindgen_ty_2 = 91 ; pub const _SC_XOPEN_CRYPT : _bindgen_ty_2 = 92 ; pub const _SC_XOPEN_ENH_I18N : _bindgen_ty_2 = 93 ; pub const _SC_XOPEN_SHM : _bindgen_ty_2 = 94 ; pub const _SC_2_CHAR_TERM : _bindgen_ty_2 = 95 ; pub const _SC_2_C_VERSION : _bindgen_ty_2 = 96 ; pub const _SC_2_UPE : _bindgen_ty_2 = 97 ; pub const _SC_XOPEN_XPG2 : _bindgen_ty_2 = 98 ; pub const _SC_XOPEN_XPG3 : _bindgen_ty_2 = 99 ; pub const _SC_XOPEN_XPG4 : _bindgen_ty_2 = 100 ; pub const _SC_CHAR_BIT : _bindgen_ty_2 = 101 ; pub const _SC_CHAR_MAX : _bindgen_ty_2 = 102 ; pub const _SC_CHAR_MIN : _bindgen_ty_2 = 103 ; pub const _SC_INT_MAX : _bindgen_ty_2 = 104 ; pub const _SC_INT_MIN : _bindgen_ty_2 = 105 ; pub const _SC_LONG_BIT : _bindgen_ty_2 = 106 ; pub const _SC_WORD_BIT : _bindgen_ty_2 = 107 ; pub const _SC_MB_LEN_MAX : _bindgen_ty_2 = 108 ; pub const _SC_NZERO : _bindgen_ty_2 = 109 ; pub const _SC_SSIZE_MAX : _bindgen_ty_2 = 110 ; pub const _SC_SCHAR_MAX : _bindgen_ty_2 = 111 ; pub const _SC_SCHAR_MIN : _bindgen_ty_2 = 112 ; pub const _SC_SHRT_MAX : _bindgen_ty_2 = 113 ; pub const _SC_SHRT_MIN : _bindgen_ty_2 = 114 ; pub const _SC_UCHAR_MAX : _bindgen_ty_2 = 115 ; pub const _SC_UINT_MAX : _bindgen_ty_2 = 116 ; pub const _SC_ULONG_MAX : _bindgen_ty_2 = 117 ; pub const _SC_USHRT_MAX : _bindgen_ty_2 = 118 ; pub const _SC_NL_ARGMAX : _bindgen_ty_2 = 119 ; pub const _SC_NL_LANGMAX : _bindgen_ty_2 = 120 ; pub const _SC_NL_MSGMAX : _bindgen_ty_2 = 121 ; pub const _SC_NL_NMAX : _bindgen_ty_2 = 122 ; pub const _SC_NL_SETMAX : _bindgen_ty_2 = 123 ; pub const _SC_NL_TEXTMAX : _bindgen_ty_2 = 124 ; pub const _SC_XBS5_ILP32_OFF32 : _bindgen_ty_2 = 125 ; pub const _SC_XBS5_ILP32_OFFBIG : _bindgen_ty_2 = 126 ; pub const _SC_XBS5_LP64_OFF64 : _bindgen_ty_2 = 127 ; pub const _SC_XBS5_LPBIG_OFFBIG : _bindgen_ty_2 = 128 ; pub const _SC_XOPEN_LEGACY : _bindgen_ty_2 = 129 ; pub const _SC_XOPEN_REALTIME : _bindgen_ty_2 = 130 ; pub const _SC_XOPEN_REALTIME_THREADS : _bindgen_ty_2 = 131 ; pub const _SC_ADVISORY_INFO : _bindgen_ty_2 = 132 ; pub const _SC_BARRIERS : _bindgen_ty_2 = 133 ; pub const _SC_BASE : _bindgen_ty_2 = 134 ; pub const _SC_C_LANG_SUPPORT : _bindgen_ty_2 = 135 ; pub const _SC_C_LANG_SUPPORT_R : _bindgen_ty_2 = 136 ; pub const _SC_CLOCK_SELECTION : _bindgen_ty_2 = 137 ; pub const _SC_CPUTIME : _bindgen_ty_2 = 138 ; pub const _SC_THREAD_CPUTIME : _bindgen_ty_2 = 139 ; pub const _SC_DEVICE_IO : _bindgen_ty_2 = 140 ; pub const _SC_DEVICE_SPECIFIC : _bindgen_ty_2 = 141 ; pub const _SC_DEVICE_SPECIFIC_R : _bindgen_ty_2 = 142 ; pub const _SC_FD_MGMT : _bindgen_ty_2 = 143 ; pub const _SC_FIFO : _bindgen_ty_2 = 144 ; pub const _SC_PIPE : _bindgen_ty_2 = 145 ; pub const _SC_FILE_ATTRIBUTES : _bindgen_ty_2 = 146 ; pub const _SC_FILE_LOCKING : _bindgen_ty_2 = 147 ; pub const _SC_FILE_SYSTEM : _bindgen_ty_2 = 148 ; pub const _SC_MONOTONIC_CLOCK : _bindgen_ty_2 = 149 ; pub const _SC_MULTI_PROCESS : _bindgen_ty_2 = 150 ; pub const _SC_SINGLE_PROCESS : _bindgen_ty_2 = 151 ; pub const _SC_NETWORKING : _bindgen_ty_2 = 152 ; pub const _SC_READER_WRITER_LOCKS : _bindgen_ty_2 = 153 ; pub const _SC_SPIN_LOCKS : _bindgen_ty_2 = 154 ; pub const _SC_REGEXP : _bindgen_ty_2 = 155 ; pub const _SC_REGEX_VERSION : _bindgen_ty_2 = 156 ; pub const _SC_SHELL : _bindgen_ty_2 = 157 ; pub const _SC_SIGNALS : _bindgen_ty_2 = 158 ; pub const _SC_SPAWN : _bindgen_ty_2 = 159 ; pub const _SC_SPORADIC_SERVER : _bindgen_ty_2 = 160 ; pub const _SC_THREAD_SPORADIC_SERVER : _bindgen_ty_2 = 161 ; pub const _SC_SYSTEM_DATABASE : _bindgen_ty_2 = 162 ; pub const _SC_SYSTEM_DATABASE_R : _bindgen_ty_2 = 163 ; pub const _SC_TIMEOUTS : _bindgen_ty_2 = 164 ; pub const _SC_TYPED_MEMORY_OBJECTS : _bindgen_ty_2 = 165 ; pub const _SC_USER_GROUPS : _bindgen_ty_2 = 166 ; pub const _SC_USER_GROUPS_R : _bindgen_ty_2 = 167 ; pub const _SC_2_PBS : _bindgen_ty_2 = 168 ; pub const _SC_2_PBS_ACCOUNTING : _bindgen_ty_2 = 169 ; pub const _SC_2_PBS_LOCATE : _bindgen_ty_2 = 170 ; pub const _SC_2_PBS_MESSAGE : _bindgen_ty_2 = 171 ; pub const _SC_2_PBS_TRACK : _bindgen_ty_2 = 172 ; pub const _SC_SYMLOOP_MAX : _bindgen_ty_2 = 173 ; pub const _SC_STREAMS : _bindgen_ty_2 = 174 ; pub const _SC_2_PBS_CHECKPOINT : _bindgen_ty_2 = 175 ; pub const _SC_V6_ILP32_OFF32 : _bindgen_ty_2 = 176 ; pub const _SC_V6_ILP32_OFFBIG : _bindgen_ty_2 = 177 ; pub const _SC_V6_LP64_OFF64 : _bindgen_ty_2 = 178 ; pub const _SC_V6_LPBIG_OFFBIG : _bindgen_ty_2 = 179 ; pub const _SC_HOST_NAME_MAX : _bindgen_ty_2 = 180 ; pub const _SC_TRACE : _bindgen_ty_2 = 181 ; pub const _SC_TRACE_EVENT_FILTER : _bindgen_ty_2 = 182 ; pub const _SC_TRACE_INHERIT : _bindgen_ty_2 = 183 ; pub const _SC_TRACE_LOG : _bindgen_ty_2 = 184 ; pub const _SC_LEVEL1_ICACHE_SIZE : _bindgen_ty_2 = 185 ; pub const _SC_LEVEL1_ICACHE_ASSOC : _bindgen_ty_2 = 186 ; pub const _SC_LEVEL1_ICACHE_LINESIZE : _bindgen_ty_2 = 187 ; pub const _SC_LEVEL1_DCACHE_SIZE : _bindgen_ty_2 = 188 ; pub const _SC_LEVEL1_DCACHE_ASSOC : _bindgen_ty_2 = 189 ; pub const _SC_LEVEL1_DCACHE_LINESIZE : _bindgen_ty_2 = 190 ; pub const _SC_LEVEL2_CACHE_SIZE : _bindgen_ty_2 = 191 ; pub const _SC_LEVEL2_CACHE_ASSOC : _bindgen_ty_2 = 192 ; pub const _SC_LEVEL2_CACHE_LINESIZE : _bindgen_ty_2 = 193 ; pub const _SC_LEVEL3_CACHE_SIZE : _bindgen_ty_2 = 194 ; pub const _SC_LEVEL3_CACHE_ASSOC : _bindgen_ty_2 = 195 ; pub const _SC_LEVEL3_CACHE_LINESIZE : _bindgen_ty_2 = 196 ; pub const _SC_LEVEL4_CACHE_SIZE : _bindgen_ty_2 = 197 ; pub const _SC_LEVEL4_CACHE_ASSOC : _bindgen_ty_2 = 198 ; pub const _SC_LEVEL4_CACHE_LINESIZE : _bindgen_ty_2 = 199 ; pub const _SC_IPV6 : _bindgen_ty_2 = 235 ; pub const _SC_RAW_SOCKETS : _bindgen_ty_2 = 236 ; pub const _SC_V7_ILP32_OFF32 : _bindgen_ty_2 = 237 ; pub const _SC_V7_ILP32_OFFBIG : _bindgen_ty_2 = 238 ; pub const _SC_V7_LP64_OFF64 : _bindgen_ty_2 = 239 ; pub const _SC_V7_LPBIG_OFFBIG : _bindgen_ty_2 = 240 ; pub const _SC_SS_REPL_MAX : _bindgen_ty_2 = 241 ; pub const _SC_TRACE_EVENT_NAME_MAX : _bindgen_ty_2 = 242 ; pub const _SC_TRACE_NAME_MAX : _bindgen_ty_2 = 243 ; pub const _SC_TRACE_SYS_MAX : _bindgen_ty_2 = 244 ; pub const _SC_TRACE_USER_EVENT_MAX : _bindgen_ty_2 = 245 ; pub const _SC_XOPEN_STREAMS : _bindgen_ty_2 = 246 ; pub const _SC_THREAD_ROBUST_PRIO_INHERIT : _bindgen_ty_2 = 247 ; pub const _SC_THREAD_ROBUST_PRIO_PROTECT : _bindgen_ty_2 = 248 ; pub type _bindgen_ty_2 = :: std :: os :: raw :: c_uint ; pub const _CS_PATH : _bindgen_ty_3 = 0 ; pub const _CS_V6_WIDTH_RESTRICTED_ENVS : _bindgen_ty_3 = 1 ; pub const _CS_GNU_LIBC_VERSION : _bindgen_ty_3 = 2 ; pub const _CS_GNU_LIBPTHREAD_VERSION : _bindgen_ty_3 = 3 ; pub const _CS_V5_WIDTH_RESTRICTED_ENVS : _bindgen_ty_3 = 4 ; pub const _CS_V7_WIDTH_RESTRICTED_ENVS : _bindgen_ty_3 = 5 ; pub const _CS_LFS_CFLAGS : _bindgen_ty_3 = 1000 ; pub const _CS_LFS_LDFLAGS : _bindgen_ty_3 = 1001 ; pub const _CS_LFS_LIBS : _bindgen_ty_3 = 1002 ; pub const _CS_LFS_LINTFLAGS : _bindgen_ty_3 = 1003 ; pub const _CS_LFS64_CFLAGS : _bindgen_ty_3 = 1004 ; pub const _CS_LFS64_LDFLAGS : _bindgen_ty_3 = 1005 ; pub const _CS_LFS64_LIBS : _bindgen_ty_3 = 1006 ; pub const _CS_LFS64_LINTFLAGS : _bindgen_ty_3 = 1007 ; pub const _CS_XBS5_ILP32_OFF32_CFLAGS : _bindgen_ty_3 = 1100 ; pub const _CS_XBS5_ILP32_OFF32_LDFLAGS : _bindgen_ty_3 = 1101 ; pub const _CS_XBS5_ILP32_OFF32_LIBS : _bindgen_ty_3 = 1102 ; pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS : _bindgen_ty_3 = 1103 ; pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS : _bindgen_ty_3 = 1104 ; pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS : _bindgen_ty_3 = 1105 ; pub const _CS_XBS5_ILP32_OFFBIG_LIBS : _bindgen_ty_3 = 1106 ; pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS : _bindgen_ty_3 = 1107 ; pub const _CS_XBS5_LP64_OFF64_CFLAGS : _bindgen_ty_3 = 1108 ; pub const _CS_XBS5_LP64_OFF64_LDFLAGS : _bindgen_ty_3 = 1109 ; pub const _CS_XBS5_LP64_OFF64_LIBS : _bindgen_ty_3 = 1110 ; pub const _CS_XBS5_LP64_OFF64_LINTFLAGS : _bindgen_ty_3 = 1111 ; pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS : _bindgen_ty_3 = 1112 ; pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS : _bindgen_ty_3 = 1113 ; pub const _CS_XBS5_LPBIG_OFFBIG_LIBS : _bindgen_ty_3 = 1114 ; pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS : _bindgen_ty_3 = 1115 ; pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS : _bindgen_ty_3 = 1116 ; pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS : _bindgen_ty_3 = 1117 ; pub const _CS_POSIX_V6_ILP32_OFF32_LIBS : _bindgen_ty_3 = 1118 ; pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS : _bindgen_ty_3 = 1119 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS : _bindgen_ty_3 = 1120 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS : _bindgen_ty_3 = 1121 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS : _bindgen_ty_3 = 1122 ; pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS : _bindgen_ty_3 = 1123 ; pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS : _bindgen_ty_3 = 1124 ; pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS : _bindgen_ty_3 = 1125 ; pub const _CS_POSIX_V6_LP64_OFF64_LIBS : _bindgen_ty_3 = 1126 ; pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS : _bindgen_ty_3 = 1127 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS : _bindgen_ty_3 = 1128 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS : _bindgen_ty_3 = 1129 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS : _bindgen_ty_3 = 1130 ; pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS : _bindgen_ty_3 = 1131 ; pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS : _bindgen_ty_3 = 1132 ; pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS : _bindgen_ty_3 = 1133 ; pub const _CS_POSIX_V7_ILP32_OFF32_LIBS : _bindgen_ty_3 = 1134 ; pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS : _bindgen_ty_3 = 1135 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS : _bindgen_ty_3 = 1136 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS : _bindgen_ty_3 = 1137 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS : _bindgen_ty_3 = 1138 ; pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS : _bindgen_ty_3 = 1139 ; pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS : _bindgen_ty_3 = 1140 ; pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS : _bindgen_ty_3 = 1141 ; pub const _CS_POSIX_V7_LP64_OFF64_LIBS : _bindgen_ty_3 = 1142 ; pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS : _bindgen_ty_3 = 1143 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS : _bindgen_ty_3 = 1144 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS : _bindgen_ty_3 = 1145 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS : _bindgen_ty_3 = 1146 ; pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS : _bindgen_ty_3 = 1147 ; pub const _CS_V6_ENV : _bindgen_ty_3 = 1148 ; pub const _CS_V7_ENV : _bindgen_ty_3 = 1149 ; pub type _bindgen_ty_3 = :: std :: os :: raw :: c_uint ; unsafe extern "C" { pub fn pathconf (__path : * const :: std :: os :: raw :: c_char , __name : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn fpathconf (__fd : :: std :: os :: raw :: c_int , __name : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn sysconf (__name : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn confstr (__name : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize) -> usize ; } unsafe extern "C" { pub fn getpid () -> __pid_t ; } unsafe extern "C" { pub fn getppid () -> __pid_t ; } unsafe extern "C" { pub fn getpgrp () -> __pid_t ; } unsafe extern "C" { pub fn __getpgid (__pid : __pid_t) -> __pid_t ; } unsafe extern "C" { pub fn getpgid (__pid : __pid_t) -> __pid_t ; } unsafe extern "C" { pub fn setpgid (__pid : __pid_t , __pgid : __pid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setpgrp () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setsid () -> __pid_t ; } unsafe extern "C" { pub fn getsid (__pid : __pid_t) -> __pid_t ; } unsafe extern "C" { pub fn getuid () -> __uid_t ; } unsafe extern "C" { pub fn geteuid () -> __uid_t ; } unsafe extern "C" { pub fn getgid () -> __gid_t ; } unsafe extern "C" { pub fn getegid () -> __gid_t ; } unsafe extern "C" { pub fn getgroups (__size : :: std :: os :: raw :: c_int , __list : * mut __gid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setuid (__uid : __uid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setreuid (__ruid : __uid_t , __euid : __uid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn seteuid (__uid : __uid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setgid (__gid : __gid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setregid (__rgid : __gid_t , __egid : __gid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setegid (__gid : __gid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn fork () -> __pid_t ; } unsafe extern "C" { pub fn vfork () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn ttyname (__fd : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn ttyname_r (__fd : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn isatty (__fd : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn ttyslot () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn link (__from : * const :: std :: os :: raw :: c_char , __to : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn linkat (__fromfd : :: std :: os :: raw :: c_int , __from : * const :: std :: os :: raw :: c_char , __tofd : :: std :: os :: raw :: c_int , __to : * const :: std :: os :: raw :: c_char , __flags : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn symlink (__from : * const :: std :: os :: raw :: c_char , __to : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn readlink (__path : * const :: std :: os :: raw :: c_char , __buf : * mut :: std :: os :: raw :: c_char , __len : usize) -> isize ; } unsafe extern "C" { pub fn symlinkat (__from : * const :: std :: os :: raw :: c_char , __tofd : :: std :: os :: raw :: c_int , __to : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn readlinkat (__fd : :: std :: os :: raw :: c_int , __path : * const :: std :: os :: raw :: c_char , __buf : * mut :: std :: os :: raw :: c_char , __len : usize) -> isize ; } unsafe extern "C" { pub fn unlink (__name : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn unlinkat (__fd : :: std :: os :: raw :: c_int , __name : * const :: std :: os :: raw :: c_char , __flag : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn rmdir (__path : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn tcgetpgrp (__fd : :: std :: os :: raw :: c_int) -> __pid_t ; } unsafe extern "C" { pub fn tcsetpgrp (__fd : :: std :: os :: raw :: c_int , __pgrp_id : __pid_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getlogin () -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn getlogin_r (__name : * mut :: std :: os :: raw :: c_char , __name_len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setlogin (__name : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub static mut optarg : * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub static mut optind : :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub static mut opterr : :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub static mut optopt : :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getopt (___argc : :: std :: os :: raw :: c_int , ___argv : * const * mut :: std :: os :: raw :: c_char , __shortopts : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn gethostname (__name : * mut :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn sethostname (__name : * const :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn sethostid (__id : :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getdomainname (__name : * mut :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setdomainname (__name : * const :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn vhangup () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn revoke (__file : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn profil (__sample_buffer : * mut :: std :: os :: raw :: c_ushort , __size : usize , __offset : usize , __scale : :: std :: os :: raw :: c_uint) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn acct (__name : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getusershell () -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn endusershell () ; } unsafe extern "C" { pub fn setusershell () ; } unsafe extern "C" { pub fn daemon (__nochdir : :: std :: os :: raw :: c_int , __noclose : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn chroot (__path : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getpass (__prompt : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn fsync (__fd : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn gethostid () -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn sync () ; } unsafe extern "C" { pub fn getpagesize () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getdtablesize () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn truncate (__file : * const :: std :: os :: raw :: c_char , __length : __off_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn ftruncate (__fd : :: std :: os :: raw :: c_int , __length : __off_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn brk (__addr : * mut :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn sbrk (__delta : isize) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn syscall (__sysno : :: std :: os :: raw :: c_long , ...) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn lockf (__fd : :: std :: os :: raw :: c_int , __cmd : :: std :: os :: raw :: c_int , __len : __off_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn fdatasync (__fildes : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn crypt (__key : * const :: std :: os :: raw :: c_char , __salt : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn getentropy (__buffer : * mut :: std :: os :: raw :: c_void , __length : usize) -> :: std :: os :: raw :: c_int ; } pub type wchar_t = :: std :: os :: raw :: c_int ; # [repr (C)] # [repr (align (16))] # [derive (Debug , Copy , Clone)] pub struct max_align_t { pub __clang_max_align_nonce1 : :: std :: os :: raw :: c_longlong , pub __bindgen_padding_0 : u64 , pub __clang_max_align_nonce2 : u128 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of max_align_t"] [:: std :: mem :: size_of :: < max_align_t > () - 32usize] ; ["Alignment of max_align_t"] [:: std :: mem :: align_of :: < max_align_t > () - 16usize] ; ["Offset of field: max_align_t::__clang_max_align_nonce1"] [:: std :: mem :: offset_of ! (max_align_t , __clang_max_align_nonce1) - 0usize] ; ["Offset of field: max_align_t::__clang_max_align_nonce2"] [:: std :: mem :: offset_of ! (max_align_t , __clang_max_align_nonce2) - 16usize] ; } ; pub type _Float32 = f32 ; pub type _Float64 = f64 ; pub type _Float32x = f64 ; pub type _Float64x = u128 ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct div_t { pub quot : :: std :: os :: raw :: c_int , pub rem : :: std :: os :: raw :: c_int , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of div_t"] [:: std :: mem :: size_of :: < div_t > () - 8usize] ; ["Alignment of div_t"] [:: std :: mem :: align_of :: < div_t > () - 4usize] ; ["Offset of field: div_t::quot"] [:: std :: mem :: offset_of ! (div_t , quot) - 0usize] ; ["Offset of field: div_t::rem"] [:: std :: mem :: offset_of ! (div_t , rem) - 4usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct ldiv_t { pub quot : :: std :: os :: raw :: c_long , pub rem : :: std :: os :: raw :: c_long , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of ldiv_t"] [:: std :: mem :: size_of :: < ldiv_t > () - 16usize] ; ["Alignment of ldiv_t"] [:: std :: mem :: align_of :: < ldiv_t > () - 8usize] ; ["Offset of field: ldiv_t::quot"] [:: std :: mem :: offset_of ! (ldiv_t , quot) - 0usize] ; ["Offset of field: ldiv_t::rem"] [:: std :: mem :: offset_of ! (ldiv_t , rem) - 8usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct lldiv_t { pub quot : :: std :: os :: raw :: c_longlong , pub rem : :: std :: os :: raw :: c_longlong , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of lldiv_t"] [:: std :: mem :: size_of :: < lldiv_t > () - 16usize] ; ["Alignment of lldiv_t"] [:: std :: mem :: align_of :: < lldiv_t > () - 8usize] ; ["Offset of field: lldiv_t::quot"] [:: std :: mem :: offset_of ! (lldiv_t , quot) - 0usize] ; ["Offset of field: lldiv_t::rem"] [:: std :: mem :: offset_of ! (lldiv_t , rem) - 8usize] ; } ; unsafe extern "C" { pub fn __ctype_get_mb_cur_max () -> usize ; } unsafe extern "C" { pub fn atof (__nptr : * const :: std :: os :: raw :: c_char) -> f64 ; } unsafe extern "C" { pub fn atoi (__nptr : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn atol (__nptr : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn atoll (__nptr : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn strtod (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char) -> f64 ; } unsafe extern "C" { pub fn strtof (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char) -> f32 ; } unsafe extern "C" { pub fn strtold (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char) -> u128 ; } unsafe extern "C" { pub fn strtol (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn strtoul (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_ulong ; } unsafe extern "C" { pub fn strtoq (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn strtouq (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_ulonglong ; } unsafe extern "C" { pub fn strtoll (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn strtoull (__nptr : * const :: std :: os :: raw :: c_char , __endptr : * mut * mut :: std :: os :: raw :: c_char , __base : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_ulonglong ; } unsafe extern "C" { pub fn l64a (__n : :: std :: os :: raw :: c_long) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn a64l (__s : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_long ; } pub type u_char = __u_char ; pub type u_short = __u_short ; pub type u_int = __u_int ; pub type u_long = __u_long ; pub type quad_t = __quad_t ; pub type u_quad_t = __u_quad_t ; pub type fsid_t = __fsid_t ; pub type loff_t = __loff_t ; pub type ino_t = __ino_t ; pub type dev_t = __dev_t ; pub type mode_t = __mode_t ; pub type nlink_t = __nlink_t ; pub type id_t = __id_t ; pub type daddr_t = __daddr_t ; pub type caddr_t = __caddr_t ; pub type key_t = __key_t ; pub type clock_t = __clock_t ; pub type clockid_t = __clockid_t ; pub type time_t = __time_t ; pub type timer_t = __timer_t ; pub type ulong = :: std :: os :: raw :: c_ulong ; pub type ushort = :: std :: os :: raw :: c_ushort ; pub type uint = :: std :: os :: raw :: c_uint ; pub type u_int8_t = __uint8_t ; pub type u_int16_t = __uint16_t ; pub type u_int32_t = __uint32_t ; pub type u_int64_t = __uint64_t ; pub type register_t = :: std :: os :: raw :: c_long ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __sigset_t { pub __val : [:: std :: os :: raw :: c_ulong ; 16usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __sigset_t"] [:: std :: mem :: size_of :: < __sigset_t > () - 128usize] ; ["Alignment of __sigset_t"] [:: std :: mem :: align_of :: < __sigset_t > () - 8usize] ; ["Offset of field: __sigset_t::__val"] [:: std :: mem :: offset_of ! (__sigset_t , __val) - 0usize] ; } ; pub type sigset_t = __sigset_t ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct timeval { pub tv_sec : __time_t , pub tv_usec : __suseconds_t , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of timeval"] [:: std :: mem :: size_of :: < timeval > () - 16usize] ; ["Alignment of timeval"] [:: std :: mem :: align_of :: < timeval > () - 8usize] ; ["Offset of field: timeval::tv_sec"] [:: std :: mem :: offset_of ! (timeval , tv_sec) - 0usize] ; ["Offset of field: timeval::tv_usec"] [:: std :: mem :: offset_of ! (timeval , tv_usec) - 8usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct timespec { pub tv_sec : __time_t , pub tv_nsec : __syscall_slong_t , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of timespec"] [:: std :: mem :: size_of :: < timespec > () - 16usize] ; ["Alignment of timespec"] [:: std :: mem :: align_of :: < timespec > () - 8usize] ; ["Offset of field: timespec::tv_sec"] [:: std :: mem :: offset_of ! (timespec , tv_sec) - 0usize] ; ["Offset of field: timespec::tv_nsec"] [:: std :: mem :: offset_of ! (timespec , tv_nsec) - 8usize] ; } ; pub type suseconds_t = __suseconds_t ; pub type __fd_mask = :: std :: os :: raw :: c_long ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct fd_set { pub __fds_bits : [__fd_mask ; 16usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of fd_set"] [:: std :: mem :: size_of :: < fd_set > () - 128usize] ; ["Alignment of fd_set"] [:: std :: mem :: align_of :: < fd_set > () - 8usize] ; ["Offset of field: fd_set::__fds_bits"] [:: std :: mem :: offset_of ! (fd_set , __fds_bits) - 0usize] ; } ; pub type fd_mask = __fd_mask ; unsafe extern "C" { pub fn select (__nfds : :: std :: os :: raw :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * mut timeval) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn pselect (__nfds : :: std :: os :: raw :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * const timespec , __sigmask : * const __sigset_t) -> :: std :: os :: raw :: c_int ; } pub type blksize_t = __blksize_t ; pub type blkcnt_t = __blkcnt_t ; pub type fsblkcnt_t = __fsblkcnt_t ; pub type fsfilcnt_t = __fsfilcnt_t ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __pthread_rwlock_arch_t { pub __readers : :: std :: os :: raw :: c_uint , pub __writers : :: std :: os :: raw :: c_uint , pub __wrphase_futex : :: std :: os :: raw :: c_uint , pub __writers_futex : :: std :: os :: raw :: c_uint , pub __pad3 : :: std :: os :: raw :: c_uint , pub __pad4 : :: std :: os :: raw :: c_uint , pub __cur_writer : :: std :: os :: raw :: c_int , pub __shared : :: std :: os :: raw :: c_int , pub __rwelision : :: std :: os :: raw :: c_schar , pub __pad1 : [:: std :: os :: raw :: c_uchar ; 7usize] , pub __pad2 : :: std :: os :: raw :: c_ulong , pub __flags : :: std :: os :: raw :: c_uint , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_rwlock_arch_t"] [:: std :: mem :: size_of :: < __pthread_rwlock_arch_t > () - 56usize] ; ["Alignment of __pthread_rwlock_arch_t"] [:: std :: mem :: align_of :: < __pthread_rwlock_arch_t > () - 8usize] ; ["Offset of field: __pthread_rwlock_arch_t::__readers"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __readers) - 0usize] ; ["Offset of field: __pthread_rwlock_arch_t::__writers"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __writers) - 4usize] ; ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __wrphase_futex) - 8usize] ; ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __writers_futex) - 12usize] ; ["Offset of field: __pthread_rwlock_arch_t::__pad3"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __pad3) - 16usize] ; ["Offset of field: __pthread_rwlock_arch_t::__pad4"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __pad4) - 20usize] ; ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __cur_writer) - 24usize] ; ["Offset of field: __pthread_rwlock_arch_t::__shared"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __shared) - 28usize] ; ["Offset of field: __pthread_rwlock_arch_t::__rwelision"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __rwelision) - 32usize] ; ["Offset of field: __pthread_rwlock_arch_t::__pad1"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __pad1) - 33usize] ; ["Offset of field: __pthread_rwlock_arch_t::__pad2"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __pad2) - 40usize] ; ["Offset of field: __pthread_rwlock_arch_t::__flags"] [:: std :: mem :: offset_of ! (__pthread_rwlock_arch_t , __flags) - 48usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __pthread_internal_list { pub __prev : * mut __pthread_internal_list , pub __next : * mut __pthread_internal_list , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_internal_list"] [:: std :: mem :: size_of :: < __pthread_internal_list > () - 16usize] ; ["Alignment of __pthread_internal_list"] [:: std :: mem :: align_of :: < __pthread_internal_list > () - 8usize] ; ["Offset of field: __pthread_internal_list::__prev"] [:: std :: mem :: offset_of ! (__pthread_internal_list , __prev) - 0usize] ; ["Offset of field: __pthread_internal_list::__next"] [:: std :: mem :: offset_of ! (__pthread_internal_list , __next) - 8usize] ; } ; pub type __pthread_list_t = __pthread_internal_list ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __pthread_mutex_s { pub __lock : :: std :: os :: raw :: c_int , pub __count : :: std :: os :: raw :: c_uint , pub __owner : :: std :: os :: raw :: c_int , pub __nusers : :: std :: os :: raw :: c_uint , pub __kind : :: std :: os :: raw :: c_int , pub __spins : :: std :: os :: raw :: c_short , pub __elision : :: std :: os :: raw :: c_short , pub __list : __pthread_list_t , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_mutex_s"] [:: std :: mem :: size_of :: < __pthread_mutex_s > () - 40usize] ; ["Alignment of __pthread_mutex_s"] [:: std :: mem :: align_of :: < __pthread_mutex_s > () - 8usize] ; ["Offset of field: __pthread_mutex_s::__lock"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __lock) - 0usize] ; ["Offset of field: __pthread_mutex_s::__count"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __count) - 4usize] ; ["Offset of field: __pthread_mutex_s::__owner"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __owner) - 8usize] ; ["Offset of field: __pthread_mutex_s::__nusers"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __nusers) - 12usize] ; ["Offset of field: __pthread_mutex_s::__kind"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __kind) - 16usize] ; ["Offset of field: __pthread_mutex_s::__spins"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __spins) - 20usize] ; ["Offset of field: __pthread_mutex_s::__elision"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __elision) - 22usize] ; ["Offset of field: __pthread_mutex_s::__list"] [:: std :: mem :: offset_of ! (__pthread_mutex_s , __list) - 24usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub struct __pthread_cond_s { pub __bindgen_anon_1 : __pthread_cond_s__bindgen_ty_1 , pub __bindgen_anon_2 : __pthread_cond_s__bindgen_ty_2 , pub __glibc_unused___g_refs : [:: std :: os :: raw :: c_uint ; 2usize] , pub __g_size : [:: std :: os :: raw :: c_uint ; 2usize] , pub __g1_orig_size : :: std :: os :: raw :: c_uint , pub __wrefs : :: std :: os :: raw :: c_uint , pub __g_signals : [:: std :: os :: raw :: c_uint ; 2usize] , } # [repr (C)] # [derive (Copy , Clone)] pub union __pthread_cond_s__bindgen_ty_1 { pub __wseq : :: std :: os :: raw :: c_ulonglong , pub __wseq32 : __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 , } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 { pub __low : :: std :: os :: raw :: c_uint , pub __high : :: std :: os :: raw :: c_uint , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_cond_s__bindgen_ty_1__bindgen_ty_1"] [:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > () - 8usize] ; ["Alignment of __pthread_cond_s__bindgen_ty_1__bindgen_ty_1"] [:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > () - 4usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1::__low"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_1__bindgen_ty_1 , __low) - 0usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_1__bindgen_ty_1::__high"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_1__bindgen_ty_1 , __high) - 4usize] ; } ; # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_cond_s__bindgen_ty_1"] [:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_1 > () - 8usize] ; ["Alignment of __pthread_cond_s__bindgen_ty_1"] [:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_1 > () - 8usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_1::__wseq"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_1 , __wseq) - 0usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_1::__wseq32"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_1 , __wseq32) - 0usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub union __pthread_cond_s__bindgen_ty_2 { pub __g1_start : :: std :: os :: raw :: c_ulonglong , pub __g1_start32 : __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 , } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 { pub __low : :: std :: os :: raw :: c_uint , pub __high : :: std :: os :: raw :: c_uint , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_cond_s__bindgen_ty_2__bindgen_ty_1"] [:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > () - 8usize] ; ["Alignment of __pthread_cond_s__bindgen_ty_2__bindgen_ty_1"] [:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > () - 4usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1::__low"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_2__bindgen_ty_1 , __low) - 0usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_2__bindgen_ty_1::__high"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_2__bindgen_ty_1 , __high) - 4usize] ; } ; # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_cond_s__bindgen_ty_2"] [:: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_2 > () - 8usize] ; ["Alignment of __pthread_cond_s__bindgen_ty_2"] [:: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_2 > () - 8usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_2::__g1_start"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_2 , __g1_start) - 0usize] ; ["Offset of field: __pthread_cond_s__bindgen_ty_2::__g1_start32"] [:: std :: mem :: offset_of ! (__pthread_cond_s__bindgen_ty_2 , __g1_start32) - 0usize] ; } ; # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __pthread_cond_s"] [:: std :: mem :: size_of :: < __pthread_cond_s > () - 48usize] ; ["Alignment of __pthread_cond_s"] [:: std :: mem :: align_of :: < __pthread_cond_s > () - 8usize] ; ["Offset of field: __pthread_cond_s::__glibc_unused___g_refs"] [:: std :: mem :: offset_of ! (__pthread_cond_s , __glibc_unused___g_refs) - 16usize] ; ["Offset of field: __pthread_cond_s::__g_size"] [:: std :: mem :: offset_of ! (__pthread_cond_s , __g_size) - 24usize] ; ["Offset of field: __pthread_cond_s::__g1_orig_size"] [:: std :: mem :: offset_of ! (__pthread_cond_s , __g1_orig_size) - 32usize] ; ["Offset of field: __pthread_cond_s::__wrefs"] [:: std :: mem :: offset_of ! (__pthread_cond_s , __wrefs) - 36usize] ; ["Offset of field: __pthread_cond_s::__g_signals"] [:: std :: mem :: offset_of ! (__pthread_cond_s , __g_signals) - 40usize] ; } ; pub type pthread_t = :: std :: os :: raw :: c_ulong ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_mutexattr_t { pub __size : [:: std :: os :: raw :: c_char ; 4usize] , pub __align : :: std :: os :: raw :: c_int , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_mutexattr_t"] [:: std :: mem :: size_of :: < pthread_mutexattr_t > () - 4usize] ; ["Alignment of pthread_mutexattr_t"] [:: std :: mem :: align_of :: < pthread_mutexattr_t > () - 4usize] ; ["Offset of field: pthread_mutexattr_t::__size"] [:: std :: mem :: offset_of ! (pthread_mutexattr_t , __size) - 0usize] ; ["Offset of field: pthread_mutexattr_t::__align"] [:: std :: mem :: offset_of ! (pthread_mutexattr_t , __align) - 0usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_condattr_t { pub __size : [:: std :: os :: raw :: c_char ; 4usize] , pub __align : :: std :: os :: raw :: c_int , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_condattr_t"] [:: std :: mem :: size_of :: < pthread_condattr_t > () - 4usize] ; ["Alignment of pthread_condattr_t"] [:: std :: mem :: align_of :: < pthread_condattr_t > () - 4usize] ; ["Offset of field: pthread_condattr_t::__size"] [:: std :: mem :: offset_of ! (pthread_condattr_t , __size) - 0usize] ; ["Offset of field: pthread_condattr_t::__align"] [:: std :: mem :: offset_of ! (pthread_condattr_t , __align) - 0usize] ; } ; pub type pthread_key_t = :: std :: os :: raw :: c_uint ; pub type pthread_once_t = :: std :: os :: raw :: c_int ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_attr_t { pub __size : [:: std :: os :: raw :: c_char ; 56usize] , pub __align : :: std :: os :: raw :: c_long , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_attr_t"] [:: std :: mem :: size_of :: < pthread_attr_t > () - 56usize] ; ["Alignment of pthread_attr_t"] [:: std :: mem :: align_of :: < pthread_attr_t > () - 8usize] ; ["Offset of field: pthread_attr_t::__size"] [:: std :: mem :: offset_of ! (pthread_attr_t , __size) - 0usize] ; ["Offset of field: pthread_attr_t::__align"] [:: std :: mem :: offset_of ! (pthread_attr_t , __align) - 0usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_mutex_t { pub __data : __pthread_mutex_s , pub __size : [:: std :: os :: raw :: c_char ; 40usize] , pub __align : :: std :: os :: raw :: c_long , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_mutex_t"] [:: std :: mem :: size_of :: < pthread_mutex_t > () - 40usize] ; ["Alignment of pthread_mutex_t"] [:: std :: mem :: align_of :: < pthread_mutex_t > () - 8usize] ; ["Offset of field: pthread_mutex_t::__data"] [:: std :: mem :: offset_of ! (pthread_mutex_t , __data) - 0usize] ; ["Offset of field: pthread_mutex_t::__size"] [:: std :: mem :: offset_of ! (pthread_mutex_t , __size) - 0usize] ; ["Offset of field: pthread_mutex_t::__align"] [:: std :: mem :: offset_of ! (pthread_mutex_t , __align) - 0usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_cond_t { pub __data : __pthread_cond_s , pub __size : [:: std :: os :: raw :: c_char ; 48usize] , pub __align : :: std :: os :: raw :: c_longlong , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_cond_t"] [:: std :: mem :: size_of :: < pthread_cond_t > () - 48usize] ; ["Alignment of pthread_cond_t"] [:: std :: mem :: align_of :: < pthread_cond_t > () - 8usize] ; ["Offset of field: pthread_cond_t::__data"] [:: std :: mem :: offset_of ! (pthread_cond_t , __data) - 0usize] ; ["Offset of field: pthread_cond_t::__size"] [:: std :: mem :: offset_of ! (pthread_cond_t , __size) - 0usize] ; ["Offset of field: pthread_cond_t::__align"] [:: std :: mem :: offset_of ! (pthread_cond_t , __align) - 0usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_rwlock_t { pub __data : __pthread_rwlock_arch_t , pub __size : [:: std :: os :: raw :: c_char ; 56usize] , pub __align : :: std :: os :: raw :: c_long , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_rwlock_t"] [:: std :: mem :: size_of :: < pthread_rwlock_t > () - 56usize] ; ["Alignment of pthread_rwlock_t"] [:: std :: mem :: align_of :: < pthread_rwlock_t > () - 8usize] ; ["Offset of field: pthread_rwlock_t::__data"] [:: std :: mem :: offset_of ! (pthread_rwlock_t , __data) - 0usize] ; ["Offset of field: pthread_rwlock_t::__size"] [:: std :: mem :: offset_of ! (pthread_rwlock_t , __size) - 0usize] ; ["Offset of field: pthread_rwlock_t::__align"] [:: std :: mem :: offset_of ! (pthread_rwlock_t , __align) - 0usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_rwlockattr_t { pub __size : [:: std :: os :: raw :: c_char ; 8usize] , pub __align : :: std :: os :: raw :: c_long , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_rwlockattr_t"] [:: std :: mem :: size_of :: < pthread_rwlockattr_t > () - 8usize] ; ["Alignment of pthread_rwlockattr_t"] [:: std :: mem :: align_of :: < pthread_rwlockattr_t > () - 8usize] ; ["Offset of field: pthread_rwlockattr_t::__size"] [:: std :: mem :: offset_of ! (pthread_rwlockattr_t , __size) - 0usize] ; ["Offset of field: pthread_rwlockattr_t::__align"] [:: std :: mem :: offset_of ! (pthread_rwlockattr_t , __align) - 0usize] ; } ; pub type pthread_spinlock_t = :: std :: os :: raw :: c_int ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_barrier_t { pub __size : [:: std :: os :: raw :: c_char ; 32usize] , pub __align : :: std :: os :: raw :: c_long , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_barrier_t"] [:: std :: mem :: size_of :: < pthread_barrier_t > () - 32usize] ; ["Alignment of pthread_barrier_t"] [:: std :: mem :: align_of :: < pthread_barrier_t > () - 8usize] ; ["Offset of field: pthread_barrier_t::__size"] [:: std :: mem :: offset_of ! (pthread_barrier_t , __size) - 0usize] ; ["Offset of field: pthread_barrier_t::__align"] [:: std :: mem :: offset_of ! (pthread_barrier_t , __align) - 0usize] ; } ; # [repr (C)] # [derive (Copy , Clone)] pub union pthread_barrierattr_t { pub __size : [:: std :: os :: raw :: c_char ; 4usize] , pub __align : :: std :: os :: raw :: c_int , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of pthread_barrierattr_t"] [:: std :: mem :: size_of :: < pthread_barrierattr_t > () - 4usize] ; ["Alignment of pthread_barrierattr_t"] [:: std :: mem :: align_of :: < pthread_barrierattr_t > () - 4usize] ; ["Offset of field: pthread_barrierattr_t::__size"] [:: std :: mem :: offset_of ! (pthread_barrierattr_t , __size) - 0usize] ; ["Offset of field: pthread_barrierattr_t::__align"] [:: std :: mem :: offset_of ! (pthread_barrierattr_t , __align) - 0usize] ; } ; unsafe extern "C" { pub fn random () -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn srandom (__seed : :: std :: os :: raw :: c_uint) ; } unsafe extern "C" { pub fn initstate (__seed : :: std :: os :: raw :: c_uint , __statebuf : * mut :: std :: os :: raw :: c_char , __statelen : usize) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn setstate (__statebuf : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct random_data { pub fptr : * mut i32 , pub rptr : * mut i32 , pub state : * mut i32 , pub rand_type : :: std :: os :: raw :: c_int , pub rand_deg : :: std :: os :: raw :: c_int , pub rand_sep : :: std :: os :: raw :: c_int , pub end_ptr : * mut i32 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of random_data"] [:: std :: mem :: size_of :: < random_data > () - 48usize] ; ["Alignment of random_data"] [:: std :: mem :: align_of :: < random_data > () - 8usize] ; ["Offset of field: random_data::fptr"] [:: std :: mem :: offset_of ! (random_data , fptr) - 0usize] ; ["Offset of field: random_data::rptr"] [:: std :: mem :: offset_of ! (random_data , rptr) - 8usize] ; ["Offset of field: random_data::state"] [:: std :: mem :: offset_of ! (random_data , state) - 16usize] ; ["Offset of field: random_data::rand_type"] [:: std :: mem :: offset_of ! (random_data , rand_type) - 24usize] ; ["Offset of field: random_data::rand_deg"] [:: std :: mem :: offset_of ! (random_data , rand_deg) - 28usize] ; ["Offset of field: random_data::rand_sep"] [:: std :: mem :: offset_of ! (random_data , rand_sep) - 32usize] ; ["Offset of field: random_data::end_ptr"] [:: std :: mem :: offset_of ! (random_data , end_ptr) - 40usize] ; } ; unsafe extern "C" { pub fn random_r (__buf : * mut random_data , __result : * mut i32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn srandom_r (__seed : :: std :: os :: raw :: c_uint , __buf : * mut random_data) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn initstate_r (__seed : :: std :: os :: raw :: c_uint , __statebuf : * mut :: std :: os :: raw :: c_char , __statelen : usize , __buf : * mut random_data) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setstate_r (__statebuf : * mut :: std :: os :: raw :: c_char , __buf : * mut random_data) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn rand () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn srand (__seed : :: std :: os :: raw :: c_uint) ; } unsafe extern "C" { pub fn rand_r (__seed : * mut :: std :: os :: raw :: c_uint) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn drand48 () -> f64 ; } unsafe extern "C" { pub fn erand48 (__xsubi : * mut :: std :: os :: raw :: c_ushort) -> f64 ; } unsafe extern "C" { pub fn lrand48 () -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn nrand48 (__xsubi : * mut :: std :: os :: raw :: c_ushort) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn mrand48 () -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn jrand48 (__xsubi : * mut :: std :: os :: raw :: c_ushort) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn srand48 (__seedval : :: std :: os :: raw :: c_long) ; } unsafe extern "C" { pub fn seed48 (__seed16v : * mut :: std :: os :: raw :: c_ushort) -> * mut :: std :: os :: raw :: c_ushort ; } unsafe extern "C" { pub fn lcong48 (__param : * mut :: std :: os :: raw :: c_ushort) ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct drand48_data { pub __x : [:: std :: os :: raw :: c_ushort ; 3usize] , pub __old_x : [:: std :: os :: raw :: c_ushort ; 3usize] , pub __c : :: std :: os :: raw :: c_ushort , pub __init : :: std :: os :: raw :: c_ushort , pub __a : :: std :: os :: raw :: c_ulonglong , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of drand48_data"] [:: std :: mem :: size_of :: < drand48_data > () - 24usize] ; ["Alignment of drand48_data"] [:: std :: mem :: align_of :: < drand48_data > () - 8usize] ; ["Offset of field: drand48_data::__x"] [:: std :: mem :: offset_of ! (drand48_data , __x) - 0usize] ; ["Offset of field: drand48_data::__old_x"] [:: std :: mem :: offset_of ! (drand48_data , __old_x) - 6usize] ; ["Offset of field: drand48_data::__c"] [:: std :: mem :: offset_of ! (drand48_data , __c) - 12usize] ; ["Offset of field: drand48_data::__init"] [:: std :: mem :: offset_of ! (drand48_data , __init) - 14usize] ; ["Offset of field: drand48_data::__a"] [:: std :: mem :: offset_of ! (drand48_data , __a) - 16usize] ; } ; unsafe extern "C" { pub fn drand48_r (__buffer : * mut drand48_data , __result : * mut f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn erand48_r (__xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn lrand48_r (__buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn nrand48_r (__xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn mrand48_r (__buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn jrand48_r (__xsubi : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data , __result : * mut :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn srand48_r (__seedval : :: std :: os :: raw :: c_long , __buffer : * mut drand48_data) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn seed48_r (__seed16v : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn lcong48_r (__param : * mut :: std :: os :: raw :: c_ushort , __buffer : * mut drand48_data) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn malloc (__size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn calloc (__nmemb : :: std :: os :: raw :: c_ulong , __size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn realloc (__ptr : * mut :: std :: os :: raw :: c_void , __size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn free (__ptr : * mut :: std :: os :: raw :: c_void) ; } unsafe extern "C" { pub fn alloca (__size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn valloc (__size : usize) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn posix_memalign (__memptr : * mut * mut :: std :: os :: raw :: c_void , __alignment : usize , __size : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn aligned_alloc (__alignment : :: std :: os :: raw :: c_ulong , __size : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn abort () -> ! ; } unsafe extern "C" { pub fn atexit (__func : :: std :: option :: Option < unsafe extern "C" fn () >) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn at_quick_exit (__func : :: std :: option :: Option < unsafe extern "C" fn () >) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn on_exit (__func : :: std :: option :: Option < unsafe extern "C" fn (__status : :: std :: os :: raw :: c_int , __arg : * mut :: std :: os :: raw :: c_void) > , __arg : * mut :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn exit (__status : :: std :: os :: raw :: c_int) -> ! ; } unsafe extern "C" { pub fn quick_exit (__status : :: std :: os :: raw :: c_int) -> ! ; } unsafe extern "C" { pub fn _Exit (__status : :: std :: os :: raw :: c_int) -> ! ; } unsafe extern "C" { pub fn getenv (__name : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn putenv (__string : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn setenv (__name : * const :: std :: os :: raw :: c_char , __value : * const :: std :: os :: raw :: c_char , __replace : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn unsetenv (__name : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn clearenv () -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn mktemp (__template : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn mkstemp (__template : * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn mkstemps (__template : * mut :: std :: os :: raw :: c_char , __suffixlen : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn mkdtemp (__template : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn system (__command : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn realpath (__name : * const :: std :: os :: raw :: c_char , __resolved : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } pub type __compar_fn_t = :: std :: option :: Option < unsafe extern "C" fn (arg1 : * const :: std :: os :: raw :: c_void , arg2 : * const :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int > ; unsafe extern "C" { pub fn bsearch (__key : * const :: std :: os :: raw :: c_void , __base : * const :: std :: os :: raw :: c_void , __nmemb : usize , __size : usize , __compar : __compar_fn_t) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn qsort (__base : * mut :: std :: os :: raw :: c_void , __nmemb : usize , __size : usize , __compar : __compar_fn_t) ; } unsafe extern "C" { pub fn abs (__x : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn labs (__x : :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn llabs (__x : :: std :: os :: raw :: c_longlong) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn div (__numer : :: std :: os :: raw :: c_int , __denom : :: std :: os :: raw :: c_int) -> div_t ; } unsafe extern "C" { pub fn ldiv (__numer : :: std :: os :: raw :: c_long , __denom : :: std :: os :: raw :: c_long) -> ldiv_t ; } unsafe extern "C" { pub fn lldiv (__numer : :: std :: os :: raw :: c_longlong , __denom : :: std :: os :: raw :: c_longlong) -> lldiv_t ; } unsafe extern "C" { pub fn ecvt (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn fcvt (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn gcvt (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn qecvt (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn qfcvt (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn qgcvt (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn ecvt_r (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn fcvt_r (__value : f64 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn qecvt_r (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn qfcvt_r (__value : u128 , __ndigit : :: std :: os :: raw :: c_int , __decpt : * mut :: std :: os :: raw :: c_int , __sign : * mut :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __len : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn mblen (__s : * const :: std :: os :: raw :: c_char , __n : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn mbtowc (__pwc : * mut wchar_t , __s : * const :: std :: os :: raw :: c_char , __n : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn wctomb (__s : * mut :: std :: os :: raw :: c_char , __wchar : wchar_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn mbstowcs (__pwcs : * mut wchar_t , __s : * const :: std :: os :: raw :: c_char , __n : usize) -> usize ; } unsafe extern "C" { pub fn wcstombs (__s : * mut :: std :: os :: raw :: c_char , __pwcs : * const wchar_t , __n : usize) -> usize ; } unsafe extern "C" { pub fn rpmatch (__response : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getsubopt (__optionp : * mut * mut :: std :: os :: raw :: c_char , __tokens : * const * mut :: std :: os :: raw :: c_char , __valuep : * mut * mut :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn getloadavg (__loadavg : * mut f64 , __nelem : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn memcpy (__dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn memmove (__dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn memccpy (__dest : * mut :: std :: os :: raw :: c_void , __src : * const :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn memset (__s : * mut :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn memcmp (__s1 : * const :: std :: os :: raw :: c_void , __s2 : * const :: std :: os :: raw :: c_void , __n : :: std :: os :: raw :: c_ulong) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn memchr (__s : * const :: std :: os :: raw :: c_void , __c : :: std :: os :: raw :: c_int , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_void ; } unsafe extern "C" { pub fn strcpy (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strncpy (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strcat (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strncat (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strcmp (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strncmp (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_ulong) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strcoll (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strxfrm (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_ulong) -> :: std :: os :: raw :: c_ulong ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __locale_struct { pub __locales : [* mut __locale_data ; 13usize] , pub __ctype_b : * const :: std :: os :: raw :: c_ushort , pub __ctype_tolower : * const :: std :: os :: raw :: c_int , pub __ctype_toupper : * const :: std :: os :: raw :: c_int , pub __names : [* const :: std :: os :: raw :: c_char ; 13usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __locale_struct"] [:: std :: mem :: size_of :: < __locale_struct > () - 232usize] ; ["Alignment of __locale_struct"] [:: std :: mem :: align_of :: < __locale_struct > () - 8usize] ; ["Offset of field: __locale_struct::__locales"] [:: std :: mem :: offset_of ! (__locale_struct , __locales) - 0usize] ; ["Offset of field: __locale_struct::__ctype_b"] [:: std :: mem :: offset_of ! (__locale_struct , __ctype_b) - 104usize] ; ["Offset of field: __locale_struct::__ctype_tolower"] [:: std :: mem :: offset_of ! (__locale_struct , __ctype_tolower) - 112usize] ; ["Offset of field: __locale_struct::__ctype_toupper"] [:: std :: mem :: offset_of ! (__locale_struct , __ctype_toupper) - 120usize] ; ["Offset of field: __locale_struct::__names"] [:: std :: mem :: offset_of ! (__locale_struct , __names) - 128usize] ; } ; pub type __locale_t = * mut __locale_struct ; pub type locale_t = __locale_t ; unsafe extern "C" { pub fn strcoll_l (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __l : locale_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strxfrm_l (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize , __l : locale_t) -> usize ; } unsafe extern "C" { pub fn strdup (__s : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strndup (__string : * const :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strchr (__s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strrchr (__s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strcspn (__s : * const :: std :: os :: raw :: c_char , __reject : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_ulong ; } unsafe extern "C" { pub fn strspn (__s : * const :: std :: os :: raw :: c_char , __accept : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_ulong ; } unsafe extern "C" { pub fn strpbrk (__s : * const :: std :: os :: raw :: c_char , __accept : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strstr (__haystack : * const :: std :: os :: raw :: c_char , __needle : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strtok (__s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn __strtok_r (__s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , __save_ptr : * mut * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strtok_r (__s : * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char , __save_ptr : * mut * mut :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strlen (__s : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_ulong ; } unsafe extern "C" { pub fn strnlen (__string : * const :: std :: os :: raw :: c_char , __maxlen : usize) -> usize ; } unsafe extern "C" { pub fn strerror (__errnum : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { # [link_name = "\u{1}__xpg_strerror_r"] pub fn strerror_r (__errnum : :: std :: os :: raw :: c_int , __buf : * mut :: std :: os :: raw :: c_char , __buflen : usize) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strerror_l (__errnum : :: std :: os :: raw :: c_int , __l : locale_t) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn bcmp (__s1 : * const :: std :: os :: raw :: c_void , __s2 : * const :: std :: os :: raw :: c_void , __n : :: std :: os :: raw :: c_ulong) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn bcopy (__src : * const :: std :: os :: raw :: c_void , __dest : * mut :: std :: os :: raw :: c_void , __n : :: std :: os :: raw :: c_ulong) ; } unsafe extern "C" { pub fn bzero (__s : * mut :: std :: os :: raw :: c_void , __n : :: std :: os :: raw :: c_ulong) ; } unsafe extern "C" { pub fn index (__s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn rindex (__s : * const :: std :: os :: raw :: c_char , __c : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn ffs (__i : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn ffsl (__l : :: std :: os :: raw :: c_long) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn ffsll (__ll : :: std :: os :: raw :: c_longlong) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strcasecmp (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strncasecmp (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_ulong) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strcasecmp_l (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __loc : locale_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn strncasecmp_l (__s1 : * const :: std :: os :: raw :: c_char , __s2 : * const :: std :: os :: raw :: c_char , __n : usize , __loc : locale_t) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn explicit_bzero (__s : * mut :: std :: os :: raw :: c_void , __n : usize) ; } unsafe extern "C" { pub fn strsep (__stringp : * mut * mut :: std :: os :: raw :: c_char , __delim : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn strsignal (__sig : :: std :: os :: raw :: c_int) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn __stpcpy (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn stpcpy (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn __stpncpy (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : usize) -> * mut :: std :: os :: raw :: c_char ; } unsafe extern "C" { pub fn stpncpy (__dest : * mut :: std :: os :: raw :: c_char , __src : * const :: std :: os :: raw :: c_char , __n : :: std :: os :: raw :: c_ulong) -> * mut :: std :: os :: raw :: c_char ; } pub type float_t = f32 ; pub type double_t = f64 ; unsafe extern "C" { pub fn __fpclassify (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __signbit (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __isinf (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __finite (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __isnan (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __iseqsig (__x : f64 , __y : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __issignaling (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn acos (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __acos (__x : f64) -> f64 ; } unsafe extern "C" { pub fn asin (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __asin (__x : f64) -> f64 ; } unsafe extern "C" { pub fn atan (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __atan (__x : f64) -> f64 ; } unsafe extern "C" { pub fn atan2 (__y : f64 , __x : f64) -> f64 ; } unsafe extern "C" { pub fn __atan2 (__y : f64 , __x : f64) -> f64 ; } unsafe extern "C" { pub fn cos (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __cos (__x : f64) -> f64 ; } unsafe extern "C" { pub fn sin (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __sin (__x : f64) -> f64 ; } unsafe extern "C" { pub fn tan (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __tan (__x : f64) -> f64 ; } unsafe extern "C" { pub fn cosh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __cosh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn sinh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __sinh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn tanh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __tanh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn acosh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __acosh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn asinh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __asinh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn atanh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __atanh (__x : f64) -> f64 ; } unsafe extern "C" { pub fn exp (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __exp (__x : f64) -> f64 ; } unsafe extern "C" { pub fn frexp (__x : f64 , __exponent : * mut :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn __frexp (__x : f64 , __exponent : * mut :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn ldexp (__x : f64 , __exponent : :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn __ldexp (__x : f64 , __exponent : :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn log (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __log (__x : f64) -> f64 ; } unsafe extern "C" { pub fn log10 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __log10 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn modf (__x : f64 , __iptr : * mut f64) -> f64 ; } unsafe extern "C" { pub fn __modf (__x : f64 , __iptr : * mut f64) -> f64 ; } unsafe extern "C" { pub fn expm1 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __expm1 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn log1p (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __log1p (__x : f64) -> f64 ; } unsafe extern "C" { pub fn logb (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __logb (__x : f64) -> f64 ; } unsafe extern "C" { pub fn exp2 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __exp2 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn log2 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __log2 (__x : f64) -> f64 ; } unsafe extern "C" { pub fn pow (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __pow (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn sqrt (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __sqrt (__x : f64) -> f64 ; } unsafe extern "C" { pub fn hypot (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __hypot (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn cbrt (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __cbrt (__x : f64) -> f64 ; } unsafe extern "C" { pub fn ceil (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __ceil (__x : f64) -> f64 ; } unsafe extern "C" { pub fn fabs (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __fabs (__x : f64) -> f64 ; } unsafe extern "C" { pub fn floor (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __floor (__x : f64) -> f64 ; } unsafe extern "C" { pub fn fmod (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __fmod (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn isinf (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn finite (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn drem (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __drem (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn significand (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __significand (__x : f64) -> f64 ; } unsafe extern "C" { pub fn copysign (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __copysign (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn nan (__tagb : * const :: std :: os :: raw :: c_char) -> f64 ; } unsafe extern "C" { pub fn __nan (__tagb : * const :: std :: os :: raw :: c_char) -> f64 ; } unsafe extern "C" { pub fn isnan (__value : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn j0 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __j0 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn j1 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __j1 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn jn (arg1 : :: std :: os :: raw :: c_int , arg2 : f64) -> f64 ; } unsafe extern "C" { pub fn __jn (arg1 : :: std :: os :: raw :: c_int , arg2 : f64) -> f64 ; } unsafe extern "C" { pub fn y0 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __y0 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn y1 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __y1 (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn yn (arg1 : :: std :: os :: raw :: c_int , arg2 : f64) -> f64 ; } unsafe extern "C" { pub fn __yn (arg1 : :: std :: os :: raw :: c_int , arg2 : f64) -> f64 ; } unsafe extern "C" { pub fn erf (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __erf (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn erfc (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __erfc (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn lgamma (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __lgamma (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn tgamma (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __tgamma (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn gamma (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn __gamma (arg1 : f64) -> f64 ; } unsafe extern "C" { pub fn lgamma_r (arg1 : f64 , __signgamp : * mut :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn __lgamma_r (arg1 : f64 , __signgamp : * mut :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn rint (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __rint (__x : f64) -> f64 ; } unsafe extern "C" { pub fn nextafter (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __nextafter (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn nexttoward (__x : f64 , __y : u128) -> f64 ; } unsafe extern "C" { pub fn __nexttoward (__x : f64 , __y : u128) -> f64 ; } unsafe extern "C" { pub fn remainder (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __remainder (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn scalbn (__x : f64 , __n : :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn __scalbn (__x : f64 , __n : :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn ilogb (__x : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __ilogb (__x : f64) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn scalbln (__x : f64 , __n : :: std :: os :: raw :: c_long) -> f64 ; } unsafe extern "C" { pub fn __scalbln (__x : f64 , __n : :: std :: os :: raw :: c_long) -> f64 ; } unsafe extern "C" { pub fn nearbyint (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __nearbyint (__x : f64) -> f64 ; } unsafe extern "C" { pub fn round (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __round (__x : f64) -> f64 ; } unsafe extern "C" { pub fn trunc (__x : f64) -> f64 ; } unsafe extern "C" { pub fn __trunc (__x : f64) -> f64 ; } unsafe extern "C" { pub fn remquo (__x : f64 , __y : f64 , __quo : * mut :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn __remquo (__x : f64 , __y : f64 , __quo : * mut :: std :: os :: raw :: c_int) -> f64 ; } unsafe extern "C" { pub fn lrint (__x : f64) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn __lrint (__x : f64) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn llrint (__x : f64) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn __llrint (__x : f64) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn lround (__x : f64) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn __lround (__x : f64) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn llround (__x : f64) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn __llround (__x : f64) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn fdim (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __fdim (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn fmax (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __fmax (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn fmin (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn __fmin (__x : f64 , __y : f64) -> f64 ; } unsafe extern "C" { pub fn fma (__x : f64 , __y : f64 , __z : f64) -> f64 ; } unsafe extern "C" { pub fn __fma (__x : f64 , __y : f64 , __z : f64) -> f64 ; } unsafe extern "C" { pub fn scalb (__x : f64 , __n : f64) -> f64 ; } unsafe extern "C" { pub fn __scalb (__x : f64 , __n : f64) -> f64 ; } unsafe extern "C" { pub fn __fpclassifyf (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __signbitf (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __isinff (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __finitef (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __isnanf (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __iseqsigf (__x : f32 , __y : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __issignalingf (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn acosf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __acosf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn asinf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __asinf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn atanf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __atanf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn atan2f (__y : f32 , __x : f32) -> f32 ; } unsafe extern "C" { pub fn __atan2f (__y : f32 , __x : f32) -> f32 ; } unsafe extern "C" { pub fn cosf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __cosf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn sinf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __sinf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn tanf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __tanf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn coshf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __coshf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn sinhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __sinhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn tanhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __tanhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn acoshf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __acoshf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn asinhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __asinhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn atanhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __atanhf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn expf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __expf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn frexpf (__x : f32 , __exponent : * mut :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn __frexpf (__x : f32 , __exponent : * mut :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn ldexpf (__x : f32 , __exponent : :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn __ldexpf (__x : f32 , __exponent : :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn logf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __logf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn log10f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __log10f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn modff (__x : f32 , __iptr : * mut f32) -> f32 ; } unsafe extern "C" { pub fn __modff (__x : f32 , __iptr : * mut f32) -> f32 ; } unsafe extern "C" { pub fn expm1f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __expm1f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn log1pf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __log1pf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn logbf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __logbf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn exp2f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __exp2f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn log2f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __log2f (__x : f32) -> f32 ; } unsafe extern "C" { pub fn powf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __powf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn sqrtf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __sqrtf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn hypotf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __hypotf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn cbrtf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __cbrtf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn ceilf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __ceilf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn fabsf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __fabsf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn floorf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __floorf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn fmodf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __fmodf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn isinff (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn finitef (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn dremf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __dremf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn significandf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __significandf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn copysignf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __copysignf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn nanf (__tagb : * const :: std :: os :: raw :: c_char) -> f32 ; } unsafe extern "C" { pub fn __nanf (__tagb : * const :: std :: os :: raw :: c_char) -> f32 ; } unsafe extern "C" { pub fn isnanf (__value : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn j0f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __j0f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn j1f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __j1f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn jnf (arg1 : :: std :: os :: raw :: c_int , arg2 : f32) -> f32 ; } unsafe extern "C" { pub fn __jnf (arg1 : :: std :: os :: raw :: c_int , arg2 : f32) -> f32 ; } unsafe extern "C" { pub fn y0f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __y0f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn y1f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __y1f (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn ynf (arg1 : :: std :: os :: raw :: c_int , arg2 : f32) -> f32 ; } unsafe extern "C" { pub fn __ynf (arg1 : :: std :: os :: raw :: c_int , arg2 : f32) -> f32 ; } unsafe extern "C" { pub fn erff (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __erff (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn erfcf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __erfcf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn lgammaf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __lgammaf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn tgammaf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __tgammaf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn gammaf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn __gammaf (arg1 : f32) -> f32 ; } unsafe extern "C" { pub fn lgammaf_r (arg1 : f32 , __signgamp : * mut :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn __lgammaf_r (arg1 : f32 , __signgamp : * mut :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn rintf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __rintf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn nextafterf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __nextafterf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn nexttowardf (__x : f32 , __y : u128) -> f32 ; } unsafe extern "C" { pub fn __nexttowardf (__x : f32 , __y : u128) -> f32 ; } unsafe extern "C" { pub fn remainderf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __remainderf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn scalbnf (__x : f32 , __n : :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn __scalbnf (__x : f32 , __n : :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn ilogbf (__x : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __ilogbf (__x : f32) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn scalblnf (__x : f32 , __n : :: std :: os :: raw :: c_long) -> f32 ; } unsafe extern "C" { pub fn __scalblnf (__x : f32 , __n : :: std :: os :: raw :: c_long) -> f32 ; } unsafe extern "C" { pub fn nearbyintf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __nearbyintf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn roundf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __roundf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn truncf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn __truncf (__x : f32) -> f32 ; } unsafe extern "C" { pub fn remquof (__x : f32 , __y : f32 , __quo : * mut :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn __remquof (__x : f32 , __y : f32 , __quo : * mut :: std :: os :: raw :: c_int) -> f32 ; } unsafe extern "C" { pub fn lrintf (__x : f32) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn __lrintf (__x : f32) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn llrintf (__x : f32) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn __llrintf (__x : f32) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn lroundf (__x : f32) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn __lroundf (__x : f32) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn llroundf (__x : f32) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn __llroundf (__x : f32) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn fdimf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __fdimf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn fmaxf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __fmaxf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn fminf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn __fminf (__x : f32 , __y : f32) -> f32 ; } unsafe extern "C" { pub fn fmaf (__x : f32 , __y : f32 , __z : f32) -> f32 ; } unsafe extern "C" { pub fn __fmaf (__x : f32 , __y : f32 , __z : f32) -> f32 ; } unsafe extern "C" { pub fn scalbf (__x : f32 , __n : f32) -> f32 ; } unsafe extern "C" { pub fn __scalbf (__x : f32 , __n : f32) -> f32 ; } unsafe extern "C" { pub fn __fpclassifyl (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __signbitl (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __isinfl (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __finitel (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __isnanl (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __iseqsigl (__x : u128 , __y : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __issignalingl (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn acosl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __acosl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn asinl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __asinl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn atanl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __atanl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn atan2l (__y : u128 , __x : u128) -> u128 ; } unsafe extern "C" { pub fn __atan2l (__y : u128 , __x : u128) -> u128 ; } unsafe extern "C" { pub fn cosl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __cosl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn sinl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __sinl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn tanl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __tanl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn coshl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __coshl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn sinhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __sinhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn tanhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __tanhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn acoshl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __acoshl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn asinhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __asinhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn atanhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __atanhl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn expl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __expl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn frexpl (__x : u128 , __exponent : * mut :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn __frexpl (__x : u128 , __exponent : * mut :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn ldexpl (__x : u128 , __exponent : :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn __ldexpl (__x : u128 , __exponent : :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn logl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __logl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn log10l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __log10l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn modfl (__x : u128 , __iptr : * mut u128) -> u128 ; } unsafe extern "C" { pub fn __modfl (__x : u128 , __iptr : * mut u128) -> u128 ; } unsafe extern "C" { pub fn expm1l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __expm1l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn log1pl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __log1pl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn logbl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __logbl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn exp2l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __exp2l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn log2l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __log2l (__x : u128) -> u128 ; } unsafe extern "C" { pub fn powl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __powl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn sqrtl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __sqrtl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn hypotl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __hypotl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn cbrtl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __cbrtl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn ceill (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __ceill (__x : u128) -> u128 ; } unsafe extern "C" { pub fn fabsl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __fabsl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn floorl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __floorl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn fmodl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __fmodl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn isinfl (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn finitel (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn dreml (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __dreml (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn significandl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __significandl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn copysignl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __copysignl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn nanl (__tagb : * const :: std :: os :: raw :: c_char) -> u128 ; } unsafe extern "C" { pub fn __nanl (__tagb : * const :: std :: os :: raw :: c_char) -> u128 ; } unsafe extern "C" { pub fn isnanl (__value : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn j0l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __j0l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn j1l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __j1l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn jnl (arg1 : :: std :: os :: raw :: c_int , arg2 : u128) -> u128 ; } unsafe extern "C" { pub fn __jnl (arg1 : :: std :: os :: raw :: c_int , arg2 : u128) -> u128 ; } unsafe extern "C" { pub fn y0l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __y0l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn y1l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __y1l (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn ynl (arg1 : :: std :: os :: raw :: c_int , arg2 : u128) -> u128 ; } unsafe extern "C" { pub fn __ynl (arg1 : :: std :: os :: raw :: c_int , arg2 : u128) -> u128 ; } unsafe extern "C" { pub fn erfl (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __erfl (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn erfcl (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __erfcl (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn lgammal (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __lgammal (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn tgammal (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __tgammal (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn gammal (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn __gammal (arg1 : u128) -> u128 ; } unsafe extern "C" { pub fn lgammal_r (arg1 : u128 , __signgamp : * mut :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn __lgammal_r (arg1 : u128 , __signgamp : * mut :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn rintl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __rintl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn nextafterl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __nextafterl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn nexttowardl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __nexttowardl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn remainderl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __remainderl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn scalbnl (__x : u128 , __n : :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn __scalbnl (__x : u128 , __n : :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn ilogbl (__x : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn __ilogbl (__x : u128) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn scalblnl (__x : u128 , __n : :: std :: os :: raw :: c_long) -> u128 ; } unsafe extern "C" { pub fn __scalblnl (__x : u128 , __n : :: std :: os :: raw :: c_long) -> u128 ; } unsafe extern "C" { pub fn nearbyintl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __nearbyintl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn roundl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __roundl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn truncl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn __truncl (__x : u128) -> u128 ; } unsafe extern "C" { pub fn remquol (__x : u128 , __y : u128 , __quo : * mut :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn __remquol (__x : u128 , __y : u128 , __quo : * mut :: std :: os :: raw :: c_int) -> u128 ; } unsafe extern "C" { pub fn lrintl (__x : u128) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn __lrintl (__x : u128) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn llrintl (__x : u128) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn __llrintl (__x : u128) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn lroundl (__x : u128) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn __lroundl (__x : u128) -> :: std :: os :: raw :: c_long ; } unsafe extern "C" { pub fn llroundl (__x : u128) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn __llroundl (__x : u128) -> :: std :: os :: raw :: c_longlong ; } unsafe extern "C" { pub fn fdiml (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __fdiml (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn fmaxl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __fmaxl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn fminl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn __fminl (__x : u128 , __y : u128) -> u128 ; } unsafe extern "C" { pub fn fmal (__x : u128 , __y : u128 , __z : u128) -> u128 ; } unsafe extern "C" { pub fn __fmal (__x : u128 , __y : u128 , __z : u128) -> u128 ; } unsafe extern "C" { pub fn scalbl (__x : u128 , __n : u128) -> u128 ; } unsafe extern "C" { pub fn __scalbl (__x : u128 , __n : u128) -> u128 ; } unsafe extern "C" { pub static mut signgam : :: std :: os :: raw :: c_int ; } pub const FP_NAN : _bindgen_ty_4 = 0 ; pub const FP_INFINITE : _bindgen_ty_4 = 1 ; pub const FP_ZERO : _bindgen_ty_4 = 2 ; pub const FP_SUBNORMAL : _bindgen_ty_4 = 3 ; pub const FP_NORMAL : _bindgen_ty_4 = 4 ; pub type _bindgen_ty_4 = :: std :: os :: raw :: c_uint ; pub type int_least8_t = __int_least8_t ; pub type int_least16_t = __int_least16_t ; pub type int_least32_t = __int_least32_t ; pub type int_least64_t = __int_least64_t ; pub type uint_least8_t = __uint_least8_t ; pub type uint_least16_t = __uint_least16_t ; pub type uint_least32_t = __uint_least32_t ; pub type uint_least64_t = __uint_least64_t ; pub type int_fast8_t = :: std :: os :: raw :: c_schar ; pub type int_fast16_t = :: std :: os :: raw :: c_long ; pub type int_fast32_t = :: std :: os :: raw :: c_long ; pub type int_fast64_t = :: std :: os :: raw :: c_long ; pub type uint_fast8_t = :: std :: os :: raw :: c_uchar ; pub type uint_fast16_t = :: std :: os :: raw :: c_ulong ; pub type uint_fast32_t = :: std :: os :: raw :: c_ulong ; pub type uint_fast64_t = :: std :: os :: raw :: c_ulong ; pub type intmax_t = __intmax_t ; pub type uintmax_t = __uintmax_t ; pub type __s8 = :: std :: os :: raw :: c_schar ; pub type __u8 = :: std :: os :: raw :: c_uchar ; pub type __s16 = :: std :: os :: raw :: c_short ; pub type __u16 = :: std :: os :: raw :: c_ushort ; pub type __s32 = :: std :: os :: raw :: c_int ; pub type __u32 = :: std :: os :: raw :: c_uint ; pub type __s64 = :: std :: os :: raw :: c_longlong ; pub type __u64 = :: std :: os :: raw :: c_ulonglong ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __kernel_fd_set { pub fds_bits : [:: std :: os :: raw :: c_ulong ; 16usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __kernel_fd_set"] [:: std :: mem :: size_of :: < __kernel_fd_set > () - 128usize] ; ["Alignment of __kernel_fd_set"] [:: std :: mem :: align_of :: < __kernel_fd_set > () - 8usize] ; ["Offset of field: __kernel_fd_set::fds_bits"] [:: std :: mem :: offset_of ! (__kernel_fd_set , fds_bits) - 0usize] ; } ; pub type __kernel_sighandler_t = :: std :: option :: Option < unsafe extern "C" fn (arg1 : :: std :: os :: raw :: c_int) > ; pub type __kernel_key_t = :: std :: os :: raw :: c_int ; pub type __kernel_mqd_t = :: std :: os :: raw :: c_int ; pub type __kernel_old_uid_t = :: std :: os :: raw :: c_ushort ; pub type __kernel_old_gid_t = :: std :: os :: raw :: c_ushort ; pub type __kernel_old_dev_t = :: std :: os :: raw :: c_ulong ; pub type __kernel_long_t = :: std :: os :: raw :: c_long ; pub type __kernel_ulong_t = :: std :: os :: raw :: c_ulong ; pub type __kernel_ino_t = __kernel_ulong_t ; pub type __kernel_mode_t = :: std :: os :: raw :: c_uint ; pub type __kernel_pid_t = :: std :: os :: raw :: c_int ; pub type __kernel_ipc_pid_t = :: std :: os :: raw :: c_int ; pub type __kernel_uid_t = :: std :: os :: raw :: c_uint ; pub type __kernel_gid_t = :: std :: os :: raw :: c_uint ; pub type __kernel_suseconds_t = __kernel_long_t ; pub type __kernel_daddr_t = :: std :: os :: raw :: c_int ; pub type __kernel_uid32_t = :: std :: os :: raw :: c_uint ; pub type __kernel_gid32_t = :: std :: os :: raw :: c_uint ; pub type __kernel_size_t = __kernel_ulong_t ; pub type __kernel_ssize_t = __kernel_long_t ; pub type __kernel_ptrdiff_t = __kernel_long_t ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __kernel_fsid_t { pub val : [:: std :: os :: raw :: c_int ; 2usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of __kernel_fsid_t"] [:: std :: mem :: size_of :: < __kernel_fsid_t > () - 8usize] ; ["Alignment of __kernel_fsid_t"] [:: std :: mem :: align_of :: < __kernel_fsid_t > () - 4usize] ; ["Offset of field: __kernel_fsid_t::val"] [:: std :: mem :: offset_of ! (__kernel_fsid_t , val) - 0usize] ; } ; pub type __kernel_off_t = __kernel_long_t ; pub type __kernel_loff_t = :: std :: os :: raw :: c_longlong ; pub type __kernel_old_time_t = __kernel_long_t ; pub type __kernel_time_t = __kernel_long_t ; pub type __kernel_time64_t = :: std :: os :: raw :: c_longlong ; pub type __kernel_clock_t = __kernel_long_t ; pub type __kernel_timer_t = :: std :: os :: raw :: c_int ; pub type __kernel_clockid_t = :: std :: os :: raw :: c_int ; pub type __kernel_caddr_t = * mut :: std :: os :: raw :: c_char ; pub type __kernel_uid16_t = :: std :: os :: raw :: c_ushort ; pub type __kernel_gid16_t = :: std :: os :: raw :: c_ushort ; pub type __le16 = __u16 ; pub type __be16 = __u16 ; pub type __le32 = __u32 ; pub type __be32 = __u32 ; pub type __le64 = __u64 ; pub type __be64 = __u64 ; pub type __sum16 = __u16 ; pub type __wsum = __u32 ; pub type __poll_t = :: std :: os :: raw :: c_uint ; pub type u8_ = :: std :: os :: raw :: c_uchar ; pub type u16_ = :: std :: os :: raw :: c_ushort ; pub type u32_ = :: std :: os :: raw :: c_uint ; pub type s32 = :: std :: os :: raw :: c_int ; pub type u64_ = :: std :: os :: raw :: c_ulonglong ; pub type s64 = :: std :: os :: raw :: c_longlong ; unsafe extern "C" { pub fn get_path (path : * mut :: std :: os :: raw :: c_char , flags : :: std :: os :: raw :: c_int) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn read_block (fd : :: std :: os :: raw :: c_int , blkno : u64_ , shift : :: std :: os :: raw :: c_int , ret_val : * mut * mut :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn read_block_crc (fd : :: std :: os :: raw :: c_int , blkno : u64_ , shift : :: std :: os :: raw :: c_int , ret_val : * mut * mut :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn read_block_verify (fd : :: std :: os :: raw :: c_int , magic : u32_ , fsid : u64_ , blkno : u64_ , shift : :: std :: os :: raw :: c_int , ret_val : * mut * mut :: std :: os :: raw :: c_void) -> :: std :: os :: raw :: c_int ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_block_header { _unused : [u8 ; 0] , } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_super_block { _unused : [u8 ; 0] , } unsafe extern "C" { pub fn write_block (fd : :: std :: os :: raw :: c_int , magic : u32_ , fsid : __le64 , seq : u64_ , blkno : u64_ , shift : :: std :: os :: raw :: c_int , hdr : * mut scoutfs_block_header) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn write_block_sync (fd : :: std :: os :: raw :: c_int , magic : u32_ , fsid : __le64 , seq : u64_ , blkno : u64_ , shift : :: std :: os :: raw :: c_int , hdr : * mut scoutfs_block_header) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn meta_super_in_use (meta_fd : :: std :: os :: raw :: c_int , meta_super : * mut scoutfs_super_block) -> :: std :: os :: raw :: c_int ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_key { pub _sk_first : __le64 , pub _sk_second : __le64 , pub _sk_third : __le64 , pub _sk_fourth : __u8 , pub sk_type : __u8 , pub sk_zone : __u8 , pub _pad : [__u8 ; 5usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_key"] [:: std :: mem :: size_of :: < scoutfs_ioctl_key > () - 32usize] ; ["Alignment of scoutfs_ioctl_key"] [:: std :: mem :: align_of :: < scoutfs_ioctl_key > () - 8usize] ; ["Offset of field: scoutfs_ioctl_key::_sk_first"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_key , _sk_first) - 0usize] ; ["Offset of field: scoutfs_ioctl_key::_sk_second"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_key , _sk_second) - 8usize] ; ["Offset of field: scoutfs_ioctl_key::_sk_third"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_key , _sk_third) - 16usize] ; ["Offset of field: scoutfs_ioctl_key::_sk_fourth"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_key , _sk_fourth) - 24usize] ; ["Offset of field: scoutfs_ioctl_key::sk_type"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_key , sk_type) - 25usize] ; ["Offset of field: scoutfs_ioctl_key::sk_zone"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_key , sk_zone) - 26usize] ; ["Offset of field: scoutfs_ioctl_key::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_key , _pad) - 27usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_walk_inodes_entry { pub major : __u64 , pub ino : __u64 , pub minor : __u32 , pub _pad : [__u8 ; 4usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_walk_inodes_entry"] [:: std :: mem :: size_of :: < scoutfs_ioctl_walk_inodes_entry > () - 24usize] ; ["Alignment of scoutfs_ioctl_walk_inodes_entry"] [:: std :: mem :: align_of :: < scoutfs_ioctl_walk_inodes_entry > () - 8usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes_entry::major"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes_entry , major) - 0usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes_entry::ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes_entry , ino) - 8usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes_entry::minor"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes_entry , minor) - 16usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes_entry::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes_entry , _pad) - 20usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_walk_inodes { pub first : scoutfs_ioctl_walk_inodes_entry , pub last : scoutfs_ioctl_walk_inodes_entry , pub entries_ptr : __u64 , pub nr_entries : __u32 , pub index : __u8 , pub _pad : [__u8 ; 11usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_walk_inodes"] [:: std :: mem :: size_of :: < scoutfs_ioctl_walk_inodes > () - 72usize] ; ["Alignment of scoutfs_ioctl_walk_inodes"] [:: std :: mem :: align_of :: < scoutfs_ioctl_walk_inodes > () - 8usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes::first"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes , first) - 0usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes::last"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes , last) - 24usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes::entries_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes , entries_ptr) - 48usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes::nr_entries"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes , nr_entries) - 56usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes::index"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes , index) - 60usize] ; ["Offset of field: scoutfs_ioctl_walk_inodes::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_walk_inodes , _pad) - 61usize] ; } ; pub const scoutfs_ino_walk_seq_type_SCOUTFS_IOC_WALK_INODES_META_SEQ : scoutfs_ino_walk_seq_type = 0 ; pub const scoutfs_ino_walk_seq_type_SCOUTFS_IOC_WALK_INODES_DATA_SEQ : scoutfs_ino_walk_seq_type = 1 ; pub const scoutfs_ino_walk_seq_type_SCOUTFS_IOC_WALK_INODES_UNKNOWN : scoutfs_ino_walk_seq_type = 2 ; pub type scoutfs_ino_walk_seq_type = :: std :: os :: raw :: c_uint ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_ino_path { pub ino : __u64 , pub dir_ino : __u64 , pub dir_pos : __u64 , pub result_ptr : __u64 , pub result_bytes : __u16 , pub _pad : [__u8 ; 6usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_ino_path"] [:: std :: mem :: size_of :: < scoutfs_ioctl_ino_path > () - 40usize] ; ["Alignment of scoutfs_ioctl_ino_path"] [:: std :: mem :: align_of :: < scoutfs_ioctl_ino_path > () - 8usize] ; ["Offset of field: scoutfs_ioctl_ino_path::ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path , ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_ino_path::dir_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path , dir_ino) - 8usize] ; ["Offset of field: scoutfs_ioctl_ino_path::dir_pos"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path , dir_pos) - 16usize] ; ["Offset of field: scoutfs_ioctl_ino_path::result_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path , result_ptr) - 24usize] ; ["Offset of field: scoutfs_ioctl_ino_path::result_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path , result_bytes) - 32usize] ; ["Offset of field: scoutfs_ioctl_ino_path::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path , _pad) - 34usize] ; } ; # [repr (C)] # [derive (Debug)] pub struct scoutfs_ioctl_ino_path_result { pub dir_ino : __u64 , pub dir_pos : __u64 , pub path_bytes : __u16 , pub _pad : [__u8 ; 6usize] , pub path : __IncompleteArrayField < __u8 > , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_ino_path_result"] [:: std :: mem :: size_of :: < scoutfs_ioctl_ino_path_result > () - 24usize] ; ["Alignment of scoutfs_ioctl_ino_path_result"] [:: std :: mem :: align_of :: < scoutfs_ioctl_ino_path_result > () - 8usize] ; ["Offset of field: scoutfs_ioctl_ino_path_result::dir_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path_result , dir_ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_ino_path_result::dir_pos"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path_result , dir_pos) - 8usize] ; ["Offset of field: scoutfs_ioctl_ino_path_result::path_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path_result , path_bytes) - 16usize] ; ["Offset of field: scoutfs_ioctl_ino_path_result::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path_result , _pad) - 18usize] ; ["Offset of field: scoutfs_ioctl_ino_path_result::path"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_ino_path_result , path) - 24usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_release { pub offset : __u64 , pub length : __u64 , pub data_version : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_release"] [:: std :: mem :: size_of :: < scoutfs_ioctl_release > () - 24usize] ; ["Alignment of scoutfs_ioctl_release"] [:: std :: mem :: align_of :: < scoutfs_ioctl_release > () - 8usize] ; ["Offset of field: scoutfs_ioctl_release::offset"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_release , offset) - 0usize] ; ["Offset of field: scoutfs_ioctl_release::length"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_release , length) - 8usize] ; ["Offset of field: scoutfs_ioctl_release::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_release , data_version) - 16usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_stage { pub data_version : __u64 , pub buf_ptr : __u64 , pub offset : __u64 , pub length : __s32 , pub _pad : __u32 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_stage"] [:: std :: mem :: size_of :: < scoutfs_ioctl_stage > () - 32usize] ; ["Alignment of scoutfs_ioctl_stage"] [:: std :: mem :: align_of :: < scoutfs_ioctl_stage > () - 8usize] ; ["Offset of field: scoutfs_ioctl_stage::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stage , data_version) - 0usize] ; ["Offset of field: scoutfs_ioctl_stage::buf_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stage , buf_ptr) - 8usize] ; ["Offset of field: scoutfs_ioctl_stage::offset"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stage , offset) - 16usize] ; ["Offset of field: scoutfs_ioctl_stage::length"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stage , length) - 24usize] ; ["Offset of field: scoutfs_ioctl_stage::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stage , _pad) - 28usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_stat_more { pub meta_seq : __u64 , pub data_seq : __u64 , pub data_version : __u64 , pub online_blocks : __u64 , pub offline_blocks : __u64 , pub crtime_sec : __u64 , pub crtime_nsec : __u32 , pub _pad : [__u8 ; 4usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_stat_more"] [:: std :: mem :: size_of :: < scoutfs_ioctl_stat_more > () - 56usize] ; ["Alignment of scoutfs_ioctl_stat_more"] [:: std :: mem :: align_of :: < scoutfs_ioctl_stat_more > () - 8usize] ; ["Offset of field: scoutfs_ioctl_stat_more::meta_seq"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , meta_seq) - 0usize] ; ["Offset of field: scoutfs_ioctl_stat_more::data_seq"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , data_seq) - 8usize] ; ["Offset of field: scoutfs_ioctl_stat_more::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , data_version) - 16usize] ; ["Offset of field: scoutfs_ioctl_stat_more::online_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , online_blocks) - 24usize] ; ["Offset of field: scoutfs_ioctl_stat_more::offline_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , offline_blocks) - 32usize] ; ["Offset of field: scoutfs_ioctl_stat_more::crtime_sec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , crtime_sec) - 40usize] ; ["Offset of field: scoutfs_ioctl_stat_more::crtime_nsec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , crtime_nsec) - 48usize] ; ["Offset of field: scoutfs_ioctl_stat_more::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_stat_more , _pad) - 52usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_data_waiting_entry { pub ino : __u64 , pub iblock : __u64 , pub op : __u8 , pub _pad : [__u8 ; 7usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_data_waiting_entry"] [:: std :: mem :: size_of :: < scoutfs_ioctl_data_waiting_entry > () - 24usize] ; ["Alignment of scoutfs_ioctl_data_waiting_entry"] [:: std :: mem :: align_of :: < scoutfs_ioctl_data_waiting_entry > () - 8usize] ; ["Offset of field: scoutfs_ioctl_data_waiting_entry::ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting_entry , ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_data_waiting_entry::iblock"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting_entry , iblock) - 8usize] ; ["Offset of field: scoutfs_ioctl_data_waiting_entry::op"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting_entry , op) - 16usize] ; ["Offset of field: scoutfs_ioctl_data_waiting_entry::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting_entry , _pad) - 17usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_data_waiting { pub flags : __u64 , pub after_ino : __u64 , pub after_iblock : __u64 , pub ents_ptr : __u64 , pub ents_nr : __u16 , pub _pad : [__u8 ; 6usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_data_waiting"] [:: std :: mem :: size_of :: < scoutfs_ioctl_data_waiting > () - 40usize] ; ["Alignment of scoutfs_ioctl_data_waiting"] [:: std :: mem :: align_of :: < scoutfs_ioctl_data_waiting > () - 8usize] ; ["Offset of field: scoutfs_ioctl_data_waiting::flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting , flags) - 0usize] ; ["Offset of field: scoutfs_ioctl_data_waiting::after_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting , after_ino) - 8usize] ; ["Offset of field: scoutfs_ioctl_data_waiting::after_iblock"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting , after_iblock) - 16usize] ; ["Offset of field: scoutfs_ioctl_data_waiting::ents_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting , ents_ptr) - 24usize] ; ["Offset of field: scoutfs_ioctl_data_waiting::ents_nr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting , ents_nr) - 32usize] ; ["Offset of field: scoutfs_ioctl_data_waiting::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_waiting , _pad) - 34usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_setattr_more { pub data_version : __u64 , pub i_size : __u64 , pub flags : __u64 , pub ctime_sec : __u64 , pub ctime_nsec : __u32 , pub crtime_nsec : __u32 , pub crtime_sec : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_setattr_more"] [:: std :: mem :: size_of :: < scoutfs_ioctl_setattr_more > () - 48usize] ; ["Alignment of scoutfs_ioctl_setattr_more"] [:: std :: mem :: align_of :: < scoutfs_ioctl_setattr_more > () - 8usize] ; ["Offset of field: scoutfs_ioctl_setattr_more::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_setattr_more , data_version) - 0usize] ; ["Offset of field: scoutfs_ioctl_setattr_more::i_size"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_setattr_more , i_size) - 8usize] ; ["Offset of field: scoutfs_ioctl_setattr_more::flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_setattr_more , flags) - 16usize] ; ["Offset of field: scoutfs_ioctl_setattr_more::ctime_sec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_setattr_more , ctime_sec) - 24usize] ; ["Offset of field: scoutfs_ioctl_setattr_more::ctime_nsec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_setattr_more , ctime_nsec) - 32usize] ; ["Offset of field: scoutfs_ioctl_setattr_more::crtime_nsec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_setattr_more , crtime_nsec) - 36usize] ; ["Offset of field: scoutfs_ioctl_setattr_more::crtime_sec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_setattr_more , crtime_sec) - 40usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_listxattr_hidden { pub id_pos : __u64 , pub buf_ptr : __u64 , pub buf_bytes : __u32 , pub hash_pos : __u32 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_listxattr_hidden"] [:: std :: mem :: size_of :: < scoutfs_ioctl_listxattr_hidden > () - 24usize] ; ["Alignment of scoutfs_ioctl_listxattr_hidden"] [:: std :: mem :: align_of :: < scoutfs_ioctl_listxattr_hidden > () - 8usize] ; ["Offset of field: scoutfs_ioctl_listxattr_hidden::id_pos"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_listxattr_hidden , id_pos) - 0usize] ; ["Offset of field: scoutfs_ioctl_listxattr_hidden::buf_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_listxattr_hidden , buf_ptr) - 8usize] ; ["Offset of field: scoutfs_ioctl_listxattr_hidden::buf_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_listxattr_hidden , buf_bytes) - 16usize] ; ["Offset of field: scoutfs_ioctl_listxattr_hidden::hash_pos"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_listxattr_hidden , hash_pos) - 20usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_search_xattrs { pub next_ino : __u64 , pub last_ino : __u64 , pub name_ptr : __u64 , pub inodes_ptr : __u64 , pub output_flags : __u64 , pub nr_inodes : __u64 , pub name_bytes : __u16 , pub _pad : [__u8 ; 6usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_search_xattrs"] [:: std :: mem :: size_of :: < scoutfs_ioctl_search_xattrs > () - 56usize] ; ["Alignment of scoutfs_ioctl_search_xattrs"] [:: std :: mem :: align_of :: < scoutfs_ioctl_search_xattrs > () - 8usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::next_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , next_ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::last_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , last_ino) - 8usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::name_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , name_ptr) - 16usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::inodes_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , inodes_ptr) - 24usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::output_flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , output_flags) - 32usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::nr_inodes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , nr_inodes) - 40usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::name_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , name_bytes) - 48usize] ; ["Offset of field: scoutfs_ioctl_search_xattrs::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_search_xattrs , _pad) - 50usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_statfs_more { pub fsid : __u64 , pub rid : __u64 , pub committed_seq : __u64 , pub total_meta_blocks : __u64 , pub total_data_blocks : __u64 , pub reserved_meta_blocks : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_statfs_more"] [:: std :: mem :: size_of :: < scoutfs_ioctl_statfs_more > () - 48usize] ; ["Alignment of scoutfs_ioctl_statfs_more"] [:: std :: mem :: align_of :: < scoutfs_ioctl_statfs_more > () - 8usize] ; ["Offset of field: scoutfs_ioctl_statfs_more::fsid"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_statfs_more , fsid) - 0usize] ; ["Offset of field: scoutfs_ioctl_statfs_more::rid"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_statfs_more , rid) - 8usize] ; ["Offset of field: scoutfs_ioctl_statfs_more::committed_seq"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_statfs_more , committed_seq) - 16usize] ; ["Offset of field: scoutfs_ioctl_statfs_more::total_meta_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_statfs_more , total_meta_blocks) - 24usize] ; ["Offset of field: scoutfs_ioctl_statfs_more::total_data_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_statfs_more , total_data_blocks) - 32usize] ; ["Offset of field: scoutfs_ioctl_statfs_more::reserved_meta_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_statfs_more , reserved_meta_blocks) - 40usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_data_wait_err { pub ino : __u64 , pub data_version : __u64 , pub offset : __u64 , pub count : __u64 , pub op : __u64 , pub err : __s64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_data_wait_err"] [:: std :: mem :: size_of :: < scoutfs_ioctl_data_wait_err > () - 48usize] ; ["Alignment of scoutfs_ioctl_data_wait_err"] [:: std :: mem :: align_of :: < scoutfs_ioctl_data_wait_err > () - 8usize] ; ["Offset of field: scoutfs_ioctl_data_wait_err::ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_wait_err , ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_data_wait_err::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_wait_err , data_version) - 8usize] ; ["Offset of field: scoutfs_ioctl_data_wait_err::offset"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_wait_err , offset) - 16usize] ; ["Offset of field: scoutfs_ioctl_data_wait_err::count"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_wait_err , count) - 24usize] ; ["Offset of field: scoutfs_ioctl_data_wait_err::op"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_wait_err , op) - 32usize] ; ["Offset of field: scoutfs_ioctl_data_wait_err::err"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_data_wait_err , err) - 40usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_alloc_detail { pub entries_ptr : __u64 , pub entries_nr : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_alloc_detail"] [:: std :: mem :: size_of :: < scoutfs_ioctl_alloc_detail > () - 16usize] ; ["Alignment of scoutfs_ioctl_alloc_detail"] [:: std :: mem :: align_of :: < scoutfs_ioctl_alloc_detail > () - 8usize] ; ["Offset of field: scoutfs_ioctl_alloc_detail::entries_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_alloc_detail , entries_ptr) - 0usize] ; ["Offset of field: scoutfs_ioctl_alloc_detail::entries_nr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_alloc_detail , entries_nr) - 8usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_alloc_detail_entry { pub id : __u64 , pub blocks : __u64 , pub type_ : __u8 , pub _bitfield_align_1 : [u8 ; 0] , pub _bitfield_1 : __BindgenBitfieldUnit < [u8 ; 1usize] > , pub __pad : [__u8 ; 6usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_alloc_detail_entry"] [:: std :: mem :: size_of :: < scoutfs_ioctl_alloc_detail_entry > () - 24usize] ; ["Alignment of scoutfs_ioctl_alloc_detail_entry"] [:: std :: mem :: align_of :: < scoutfs_ioctl_alloc_detail_entry > () - 8usize] ; ["Offset of field: scoutfs_ioctl_alloc_detail_entry::id"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_alloc_detail_entry , id) - 0usize] ; ["Offset of field: scoutfs_ioctl_alloc_detail_entry::blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_alloc_detail_entry , blocks) - 8usize] ; ["Offset of field: scoutfs_ioctl_alloc_detail_entry::type_"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_alloc_detail_entry , type_) - 16usize] ; ["Offset of field: scoutfs_ioctl_alloc_detail_entry::__pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_alloc_detail_entry , __pad) - 18usize] ; } ; impl scoutfs_ioctl_alloc_detail_entry { # [inline] pub fn meta (& self) -> __u8 { unsafe { :: std :: mem :: transmute (self . _bitfield_1 . get (0usize , 1u8) as u8) } } # [inline] pub fn set_meta (& mut self , val : __u8) { unsafe { let val : u8 = :: std :: mem :: transmute (val) ; self . _bitfield_1 . set (0usize , 1u8 , val as u64) } } # [inline] pub unsafe fn meta_raw (this : * const Self) -> __u8 { unsafe { :: std :: mem :: transmute (< __BindgenBitfieldUnit < [u8 ; 1usize] > > :: raw_get (:: std :: ptr :: addr_of ! ((* this) . _bitfield_1) , 0usize , 1u8 ,) as u8) } } # [inline] pub unsafe fn set_meta_raw (this : * mut Self , val : __u8) { unsafe { let val : u8 = :: std :: mem :: transmute (val) ; < __BindgenBitfieldUnit < [u8 ; 1usize] > > :: raw_set (:: std :: ptr :: addr_of_mut ! ((* this) . _bitfield_1) , 0usize , 1u8 , val as u64 ,) } } # [inline] pub fn avail (& self) -> __u8 { unsafe { :: std :: mem :: transmute (self . _bitfield_1 . get (1usize , 1u8) as u8) } } # [inline] pub fn set_avail (& mut self , val : __u8) { unsafe { let val : u8 = :: std :: mem :: transmute (val) ; self . _bitfield_1 . set (1usize , 1u8 , val as u64) } } # [inline] pub unsafe fn avail_raw (this : * const Self) -> __u8 { unsafe { :: std :: mem :: transmute (< __BindgenBitfieldUnit < [u8 ; 1usize] > > :: raw_get (:: std :: ptr :: addr_of ! ((* this) . _bitfield_1) , 1usize , 1u8 ,) as u8) } } # [inline] pub unsafe fn set_avail_raw (this : * mut Self , val : __u8) { unsafe { let val : u8 = :: std :: mem :: transmute (val) ; < __BindgenBitfieldUnit < [u8 ; 1usize] > > :: raw_set (:: std :: ptr :: addr_of_mut ! ((* this) . _bitfield_1) , 1usize , 1u8 , val as u64 ,) } } # [inline] pub fn __bit_pad (& self) -> __u8 { unsafe { :: std :: mem :: transmute (self . _bitfield_1 . get (2usize , 6u8) as u8) } } # [inline] pub fn set___bit_pad (& mut self , val : __u8) { unsafe { let val : u8 = :: std :: mem :: transmute (val) ; self . _bitfield_1 . set (2usize , 6u8 , val as u64) } } # [inline] pub unsafe fn __bit_pad_raw (this : * const Self) -> __u8 { unsafe { :: std :: mem :: transmute (< __BindgenBitfieldUnit < [u8 ; 1usize] > > :: raw_get (:: std :: ptr :: addr_of ! ((* this) . _bitfield_1) , 2usize , 6u8 ,) as u8) } } # [inline] pub unsafe fn set___bit_pad_raw (this : * mut Self , val : __u8) { unsafe { let val : u8 = :: std :: mem :: transmute (val) ; < __BindgenBitfieldUnit < [u8 ; 1usize] > > :: raw_set (:: std :: ptr :: addr_of_mut ! ((* this) . _bitfield_1) , 2usize , 6u8 , val as u64 ,) } } # [inline] pub fn new_bitfield_1 (meta : __u8 , avail : __u8 , __bit_pad : __u8) -> __BindgenBitfieldUnit < [u8 ; 1usize] > { let mut __bindgen_bitfield_unit : __BindgenBitfieldUnit < [u8 ; 1usize] > = Default :: default () ; __bindgen_bitfield_unit . set (0usize , 1u8 , { let meta : u8 = unsafe { :: std :: mem :: transmute (meta) } ; meta as u64 }) ; __bindgen_bitfield_unit . set (1usize , 1u8 , { let avail : u8 = unsafe { :: std :: mem :: transmute (avail) } ; avail as u64 }) ; __bindgen_bitfield_unit . set (2usize , 6u8 , { let __bit_pad : u8 = unsafe { :: std :: mem :: transmute (__bit_pad) } ; __bit_pad as u64 }) ; __bindgen_bitfield_unit } } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_move_blocks { pub from_fd : __u64 , pub from_off : __u64 , pub len : __u64 , pub to_off : __u64 , pub data_version : __u64 , pub flags : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_move_blocks"] [:: std :: mem :: size_of :: < scoutfs_ioctl_move_blocks > () - 48usize] ; ["Alignment of scoutfs_ioctl_move_blocks"] [:: std :: mem :: align_of :: < scoutfs_ioctl_move_blocks > () - 8usize] ; ["Offset of field: scoutfs_ioctl_move_blocks::from_fd"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_move_blocks , from_fd) - 0usize] ; ["Offset of field: scoutfs_ioctl_move_blocks::from_off"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_move_blocks , from_off) - 8usize] ; ["Offset of field: scoutfs_ioctl_move_blocks::len"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_move_blocks , len) - 16usize] ; ["Offset of field: scoutfs_ioctl_move_blocks::to_off"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_move_blocks , to_off) - 24usize] ; ["Offset of field: scoutfs_ioctl_move_blocks::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_move_blocks , data_version) - 32usize] ; ["Offset of field: scoutfs_ioctl_move_blocks::flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_move_blocks , flags) - 40usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_resize_devices { pub new_total_meta_blocks : __u64 , pub new_total_data_blocks : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_resize_devices"] [:: std :: mem :: size_of :: < scoutfs_ioctl_resize_devices > () - 16usize] ; ["Alignment of scoutfs_ioctl_resize_devices"] [:: std :: mem :: align_of :: < scoutfs_ioctl_resize_devices > () - 8usize] ; ["Offset of field: scoutfs_ioctl_resize_devices::new_total_meta_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_resize_devices , new_total_meta_blocks) - 0usize] ; ["Offset of field: scoutfs_ioctl_resize_devices::new_total_data_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_resize_devices , new_total_data_blocks) - 8usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_read_xattr_totals { pub pos_name : [__u64 ; 3usize] , pub totals_ptr : __u64 , pub totals_bytes : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_read_xattr_totals"] [:: std :: mem :: size_of :: < scoutfs_ioctl_read_xattr_totals > () - 40usize] ; ["Alignment of scoutfs_ioctl_read_xattr_totals"] [:: std :: mem :: align_of :: < scoutfs_ioctl_read_xattr_totals > () - 8usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_totals::pos_name"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_totals , pos_name) - 0usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_totals::totals_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_totals , totals_ptr) - 24usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_totals::totals_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_totals , totals_bytes) - 32usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_xattr_total { pub name : [__u64 ; 3usize] , pub total : __u64 , pub count : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_xattr_total"] [:: std :: mem :: size_of :: < scoutfs_ioctl_xattr_total > () - 40usize] ; ["Alignment of scoutfs_ioctl_xattr_total"] [:: std :: mem :: align_of :: < scoutfs_ioctl_xattr_total > () - 8usize] ; ["Offset of field: scoutfs_ioctl_xattr_total::name"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_xattr_total , name) - 0usize] ; ["Offset of field: scoutfs_ioctl_xattr_total::total"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_xattr_total , total) - 24usize] ; ["Offset of field: scoutfs_ioctl_xattr_total::count"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_xattr_total , count) - 32usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_get_allocated_inos { pub start_ino : __u64 , pub inos_ptr : __u64 , pub inos_bytes : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_get_allocated_inos"] [:: std :: mem :: size_of :: < scoutfs_ioctl_get_allocated_inos > () - 24usize] ; ["Alignment of scoutfs_ioctl_get_allocated_inos"] [:: std :: mem :: align_of :: < scoutfs_ioctl_get_allocated_inos > () - 8usize] ; ["Offset of field: scoutfs_ioctl_get_allocated_inos::start_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_allocated_inos , start_ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_get_allocated_inos::inos_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_allocated_inos , inos_ptr) - 8usize] ; ["Offset of field: scoutfs_ioctl_get_allocated_inos::inos_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_allocated_inos , inos_bytes) - 16usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_get_referring_entries { pub ino : __u64 , pub dir_ino : __u64 , pub dir_pos : __u64 , pub entries_ptr : __u64 , pub entries_bytes : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_get_referring_entries"] [:: std :: mem :: size_of :: < scoutfs_ioctl_get_referring_entries > () - 40usize] ; ["Alignment of scoutfs_ioctl_get_referring_entries"] [:: std :: mem :: align_of :: < scoutfs_ioctl_get_referring_entries > () - 8usize] ; ["Offset of field: scoutfs_ioctl_get_referring_entries::ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_referring_entries , ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_get_referring_entries::dir_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_referring_entries , dir_ino) - 8usize] ; ["Offset of field: scoutfs_ioctl_get_referring_entries::dir_pos"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_referring_entries , dir_pos) - 16usize] ; ["Offset of field: scoutfs_ioctl_get_referring_entries::entries_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_referring_entries , entries_ptr) - 24usize] ; ["Offset of field: scoutfs_ioctl_get_referring_entries::entries_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_referring_entries , entries_bytes) - 32usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_dirent { pub dir_ino : __u64 , pub dir_pos : __u64 , pub ino : __u64 , pub entry_bytes : __u16 , pub flags : __u8 , pub d_type : __u8 , pub name_len : __u8 , pub name : [__u8 ; 3usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_dirent"] [:: std :: mem :: size_of :: < scoutfs_ioctl_dirent > () - 32usize] ; ["Alignment of scoutfs_ioctl_dirent"] [:: std :: mem :: align_of :: < scoutfs_ioctl_dirent > () - 8usize] ; ["Offset of field: scoutfs_ioctl_dirent::dir_ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , dir_ino) - 0usize] ; ["Offset of field: scoutfs_ioctl_dirent::dir_pos"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , dir_pos) - 8usize] ; ["Offset of field: scoutfs_ioctl_dirent::ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , ino) - 16usize] ; ["Offset of field: scoutfs_ioctl_dirent::entry_bytes"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , entry_bytes) - 24usize] ; ["Offset of field: scoutfs_ioctl_dirent::flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , flags) - 26usize] ; ["Offset of field: scoutfs_ioctl_dirent::d_type"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , d_type) - 27usize] ; ["Offset of field: scoutfs_ioctl_dirent::name_len"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , name_len) - 28usize] ; ["Offset of field: scoutfs_ioctl_dirent::name"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_dirent , name) - 29usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_inode_attr_x { pub x_mask : __u64 , pub x_flags : __u64 , pub meta_seq : __u64 , pub data_seq : __u64 , pub data_version : __u64 , pub online_blocks : __u64 , pub offline_blocks : __u64 , pub ctime_sec : __u64 , pub ctime_nsec : __u32 , pub crtime_nsec : __u32 , pub crtime_sec : __u64 , pub size : __u64 , pub bits : __u64 , pub project_id : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_inode_attr_x"] [:: std :: mem :: size_of :: < scoutfs_ioctl_inode_attr_x > () - 104usize] ; ["Alignment of scoutfs_ioctl_inode_attr_x"] [:: std :: mem :: align_of :: < scoutfs_ioctl_inode_attr_x > () - 8usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::x_mask"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , x_mask) - 0usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::x_flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , x_flags) - 8usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::meta_seq"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , meta_seq) - 16usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::data_seq"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , data_seq) - 24usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , data_version) - 32usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::online_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , online_blocks) - 40usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::offline_blocks"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , offline_blocks) - 48usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::ctime_sec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , ctime_sec) - 56usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::ctime_nsec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , ctime_nsec) - 64usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::crtime_nsec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , crtime_nsec) - 68usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::crtime_sec"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , crtime_sec) - 72usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::size"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , size) - 80usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::bits"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , bits) - 88usize] ; ["Offset of field: scoutfs_ioctl_inode_attr_x::project_id"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_inode_attr_x , project_id) - 96usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_quota_rule { pub name_val : [__u64 ; 3usize] , pub limit : __u64 , pub prio : __u8 , pub op : __u8 , pub rule_flags : __u8 , pub name_source : [__u8 ; 3usize] , pub name_flags : [__u8 ; 3usize] , pub _pad : [__u8 ; 7usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_quota_rule"] [:: std :: mem :: size_of :: < scoutfs_ioctl_quota_rule > () - 48usize] ; ["Alignment of scoutfs_ioctl_quota_rule"] [:: std :: mem :: align_of :: < scoutfs_ioctl_quota_rule > () - 8usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::name_val"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , name_val) - 0usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::limit"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , limit) - 24usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::prio"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , prio) - 32usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::op"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , op) - 33usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::rule_flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , rule_flags) - 34usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::name_source"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , name_source) - 35usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::name_flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , name_flags) - 38usize] ; ["Offset of field: scoutfs_ioctl_quota_rule::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_quota_rule , _pad) - 41usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_get_quota_rules { pub iterator : [__u64 ; 2usize] , pub rules_ptr : __u64 , pub rules_nr : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_get_quota_rules"] [:: std :: mem :: size_of :: < scoutfs_ioctl_get_quota_rules > () - 32usize] ; ["Alignment of scoutfs_ioctl_get_quota_rules"] [:: std :: mem :: align_of :: < scoutfs_ioctl_get_quota_rules > () - 8usize] ; ["Offset of field: scoutfs_ioctl_get_quota_rules::iterator"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_quota_rules , iterator) - 0usize] ; ["Offset of field: scoutfs_ioctl_get_quota_rules::rules_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_quota_rules , rules_ptr) - 16usize] ; ["Offset of field: scoutfs_ioctl_get_quota_rules::rules_nr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_get_quota_rules , rules_nr) - 24usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_xattr_index_entry { pub minor : __u64 , pub ino : __u64 , pub major : __u8 , pub _pad : [__u8 ; 7usize] , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_xattr_index_entry"] [:: std :: mem :: size_of :: < scoutfs_ioctl_xattr_index_entry > () - 24usize] ; ["Alignment of scoutfs_ioctl_xattr_index_entry"] [:: std :: mem :: align_of :: < scoutfs_ioctl_xattr_index_entry > () - 8usize] ; ["Offset of field: scoutfs_ioctl_xattr_index_entry::minor"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_xattr_index_entry , minor) - 0usize] ; ["Offset of field: scoutfs_ioctl_xattr_index_entry::ino"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_xattr_index_entry , ino) - 8usize] ; ["Offset of field: scoutfs_ioctl_xattr_index_entry::major"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_xattr_index_entry , major) - 16usize] ; ["Offset of field: scoutfs_ioctl_xattr_index_entry::_pad"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_xattr_index_entry , _pad) - 17usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_read_xattr_index { pub flags : __u64 , pub first : scoutfs_ioctl_xattr_index_entry , pub last : scoutfs_ioctl_xattr_index_entry , pub entries_ptr : __u64 , pub entries_nr : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_read_xattr_index"] [:: std :: mem :: size_of :: < scoutfs_ioctl_read_xattr_index > () - 72usize] ; ["Alignment of scoutfs_ioctl_read_xattr_index"] [:: std :: mem :: align_of :: < scoutfs_ioctl_read_xattr_index > () - 8usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_index::flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_index , flags) - 0usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_index::first"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_index , first) - 8usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_index::last"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_index , last) - 32usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_index::entries_ptr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_index , entries_ptr) - 56usize] ; ["Offset of field: scoutfs_ioctl_read_xattr_index::entries_nr"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_read_xattr_index , entries_nr) - 64usize] ; } ; # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct scoutfs_ioctl_punch_offline { pub offset : __u64 , pub len : __u64 , pub data_version : __u64 , pub flags : __u64 , } # [allow (clippy :: unnecessary_operation , clippy :: identity_op)] const _ : () = { ["Size of scoutfs_ioctl_punch_offline"] [:: std :: mem :: size_of :: < scoutfs_ioctl_punch_offline > () - 32usize] ; ["Alignment of scoutfs_ioctl_punch_offline"] [:: std :: mem :: align_of :: < scoutfs_ioctl_punch_offline > () - 8usize] ; ["Offset of field: scoutfs_ioctl_punch_offline::offset"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_punch_offline , offset) - 0usize] ; ["Offset of field: scoutfs_ioctl_punch_offline::len"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_punch_offline , len) - 8usize] ; ["Offset of field: scoutfs_ioctl_punch_offline::data_version"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_punch_offline , data_version) - 16usize] ; ["Offset of field: scoutfs_ioctl_punch_offline::flags"] [:: std :: mem :: offset_of ! (scoutfs_ioctl_punch_offline , flags) - 24usize] ; } ; unsafe extern "C" { pub fn wrap_walk_inodes (root_fd : :: std :: os :: raw :: c_int , user : * mut scoutfs_ioctl_walk_inodes) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn wrap_ino_path (root_fd : :: std :: os :: raw :: c_int , path : * mut scoutfs_ioctl_ino_path) -> :: std :: os :: raw :: c_int ; } unsafe extern "C" { pub fn wrap_listxattr_hidden (root_fd : :: std :: os :: raw :: c_int , existing_attrs : * mut scoutfs_ioctl_listxattr_hidden) -> :: std :: os :: raw :: c_int ; } # [repr (C)] # [derive (Debug , Copy , Clone)] pub struct __locale_data { pub _address : u8 , }